{
  "provinsi": [
    {
      "kode_provinsi": "prov-1",
      "nama_provinsi": "ACEH",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Coat_of_arms_of_Aceh.svg/1200px-Coat_of_arms_of_Aceh.svg.png",
      "tari_tradisional": {
        "name": "Tari Saman",
        "description": "Tari Saman adalah tarian Suku Gayo yang biasa ditampilkan untuk merayakan peristiwa-peristiwa penting dalam adat. Syair dalam tarian saman mempergunakan Bahasa Gayo.\nSelain itu biasanya tarian ini juga ditampilkan untuk merayakan kelahiran Nabi Muhammad SAW. Tari saman biasanya ditampilkan tidak menggunakan iringan alat musik, akan tetapi\nmenggunakan suara dari para penari dan tepuk tangan mereka yang biasanya diikuti dengan memukul dada dan pangkal paha mereka sebagai sinkronisasi dan menghempaskan badan\nke berbagai arah. Tarian ini dipandu oleh seorang pemimpin yang lazimnya disebut syekh. Tarian ini mencerminkan pendidikan, keagamaan, sopan santun, kepahlawanan, kekompakkan dan kebersamaan.",
        "image": "https://asset-a.grid.id//crop/0x0:0x0/700x465/photo/bobofoto/original/2916_tari-saman.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Bungong Jempa",
        "description": "Bungong Jeumpa adalah salah satu lagu daerah yang berasal dari Aceh. Dalam bahasa Aceh, Bungong Jeumpa berarti bunga cempaka. Lagu Bungong Jeumpa ini sangat terkenal terutama di Aceh karena lagu ini\nmemiliki arti penting dalam budaya suku Aceh. Pada lirik lagu ini menceritakan tentang bunga cempaka berwarna putih kuning bercampur merah yang indah dan harum, yang terkenal di Aceh. Lagu ini\nmenggambarkan tentang semangat dan keindahan Tanah Aceh yang digambarkan dengan bunga khas di Kesultanan Aceh yaitu Bungong Jeumpa.",
        "image": "https://kitaberagamhome.files.wordpress.com/2019/01/meuseujid_raya.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Krong Bade ",
        "description": "Rumah Krong Bade atau Rumoh Aceh adalah rumah adat khas Aceh. Rumah ini memiliki tiga tangga di bagian depan rumah, untuk pintu masuk tamu dan orang yang tinggal. Selain itu, dinding rumah ini terdapat ukiran khas yang disesuaikan dengan tingkat ekonomi penghuninya. Rumoh Aceh ini berbentuk persegi panjang yang mana memanjang dari timur ke barat dengan atap yang menggunakan daun rumba.",
        "image": "https://asset-a.grid.id//crop/0x0:0x0/700x465/photo/bobofoto/original/1535_rumah-adat-aceh-krong-bade-foto-klipingco.jpg"
      },
      "senjata_khas": {
        "name": "Rencong",
        "description": "Rencong adalah salah satu senjata tradisional dari Provinsi Aceh. Rencong termasuk ke dalam daftar Warisan Budaya Tak Benda Indonesia menurut situs Kementrian Pendidikan dan Kebudayaan. Selain sebagai senjata perang, senjata ini melambangkan keberanian dan kegagahan Aceh dan digunakan pula untuk pertujukan Tari Seudati. Rencong memiliki 4 jenis yaitu Rencong Meupucok, Rencong Meucugek, Rencong Meukuree, dan Rencong Pudoi. Keempat senjata tersebut walaupun sama-sama bernama \"Rencong\" namun bentuk keempatnya berbeda-beda.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/3/3f/COLLECTIE_TROPENMUSEUM_Dolk_met_rechthoekig_gebogen_hoornen_greep_en_houten_schede_TMnr_151-19.jpg"
      },
      "pakaian_adat": {
        "name": "Ulee Balang",
        "description": "Ulee Balang adalah pakaian adat dari Provinsi Aceh. Awalnya Ulee Balang hanya dipakai oleh keluarga raja, sekarang pakaian adat tersebut menjadi pakaian adat Aceh dan dipakai untuk upacara adat. Pakaian adat\nUlee Balang bagi laki-laki dikenal dengan sebuatan Linto Baro. Sedangkan pakaian adat untuk perempuan disebut Daro Baro. Pada Linto Baro terdapat Meukeutop yaitui penutup kepala, Meukasah yaitu baju berwarna\nhitam yang terbuat dari benang sutera, dan Sileuweu yaitu celana cekak musang yang juga berwarna hitam. Pada Daro Baro terdapat baju berwarna kuning yang terbuat dari benang sutera, Sileuweu yaitu celana\ncekak musang, dan berbagai perhiasan seperti Patam Dhoe yang merupakan perhiasan berbentuk mahkota, Subang atau anting-anting, dan Taloe Tokoe Bieung Meuih yang merupakan perhiasan berupa kalung.\nWarna pakaian Daro Baro lebih beragam dibandingkan dengan warna pakaian Linto Baro.",
        "image": "https://www.goodnewsfromindonesia.id/uploads/post/large-d4zklyywsaeirm8-1bfe38be58518ad2523736e2b02ae9ee.jpg"
      }

    },
    {
      "kode_provinsi": "prov-2",
      "nama_provinsi": "SUMATERA UTARA",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Coat_of_arms_of_North_Sumatra.svg/1200px-Coat_of_arms_of_North_Sumatra.svg.png",
      "tari_tradisional": {
        "name": "Tari Tor-Tor",
        "description": "Tari Tor Tor adalah tarian seremonial yang disajikan dengan musik gondang. Secara fisik, Tor Tor merupakan tarian, namun makna dari gerakan-gerakannya menunjukkan Tor Tor adalah sebuah media\nkomunikasi,dimana melalui gerakan yang disajikan terjadi interaksi antara orang yang mengikuti upacara. Dalam pelaksanaan tarian ini, salah seorang dari hasuhutan (yang mempunyai hajat) akan meminta\npermintaan kepada penabuh gondang dengan kata-kata yang sopan dan santun. Setiap selesai satu permintaan selalu diselingi dengan pukulan gondang dengan ritme tertentu dalam beberapa saat. Setelah\npermintaandilaksanakan dengan baik maka barisan keluarga suhut yang telah siap menari mengatur susunan tempat berdirinya untuk memulai menari.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Tor-Tor_Pose.jpg/800px-Tor-Tor_Pose.jpg",
        "video": "MdM9MH6JcfI"
      },
      "lagu_daerah": {
        "name": "Sinanggar Tulo",
        "description": "Sinanggar Tullo adalah salah satu lagu daerah yang berasal dari Sumatera Utara. Lagu Sinanggar Tullo ini sangat terkenal terutama di Sumatera Utara karena sering dipakai sebagai iringan musik untuk menari.\nPada lirik lagu ini menjelaskan seorang laki-laki yang bingung mencari ranting-ranting untuk dijadikan kayu bakar. Lirik lagu ini menggambarkan tentang keluh kesah seorang laki-laki yang harus menuruti permintaan\nibunya yang menginginkan anaknya untuk mencari pasangan yang memiliki marga sama dengan sang ibu.",
        "image": "https://1.bp.blogspot.com/-eU2ruJ6iuA4/YCicv-NBYAI/AAAAAAAAE2A/7rFiwA5yOaEX2WHFmz3kH6sIjaIztuKigCLcBGAsYHQ/w640-h360/Ini%2BAlasan%2BDanau%2BToba%2BJadi%2BDestinasi%2BSuper%2BPrioritas%2BKelas%2BDunia%2Boleh%2BKemenpar.lelemuku.com.jpg",
        "video": "YWnFIDHMraA"
      },
      "rumah_adat": {
        "name": "Rumah Bolon",
        "description": "Rumah Bolon adalah rumah adat khas Sumatera Utara. Dulu, rumah adat Sumatera Utara menjadi tempat tinggal 13 raja yang berdomisili di Sumatra Utara. Rumah Bolon ini berbentuk persegi empat dengan model\npanggung, dengan tangga di tengah badan rumah untuk memudahkan penghuni masuk ke dalam rumah. Ada satu ruangan di dalamnya, ruang jabu soding yang khusus untuk anak perempuan.\n",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Rumah_Bolon_%28Batak_Traditional_House%29.jpg/1920px-Rumah_Bolon_%28Batak_Traditional_House%29.jpg"
      },
      "senjata_khas": {
        "name": "Piso Gaja Dompak",
        "description": "Piso Gaja Dompak adalah salah satu senjata tradisional dari Provinsi Sumatera Utara. Warga Sumatera Utara percaya bahwa senjata ini dulunya sering digunakan oleh para Raja Batak di kerajaan. Piso memiliki arti\npisau, gaja memiliki arti gajah, dan dompak memiliki arti kewibawaan. Kata Gaja Dompak ini mengarah pada bentuk khas suku Batak, di mana bagian gagang senjatanya berbentuk gajah. Senjata ini hanya dimiliki oleh\norang dari suku Batak secara turun temurun. Dulu, senjata ini dikatakan digunakan Raja Batak untuk memperluas wilayah daerah kekuasaannya.",
        "image": "https://1.bp.blogspot.com/-7PplQfsrXbE/V6PsHHMamBI/AAAAAAAAC0E/5M8uN6awMzcV0icwwLCuXhxmWq46r4I-ACLcB/s400/piso%2Bgaja%2Bdompak.jpg"
      },
      "pakaian_adat": {
        "name": "Ulos",
        "description": "Ulos adalah pakaian adat dari Provinsi Sumatera Utara. Ulos adalah kain yang ditenun dan berbentuk selendang. Awalnya Ulos berfungsi sebagai pakaian penghangat dan dipakai sehari-hari. Namun saat ini, pakaian ini\nmenjadi makna simbolik untuk pelaksanaan upacara adat serta menghormati orang-orang yang hadir di dalamnya. Warna dominan pada Ulos adalah merah, hitam, dan putih yang dihiasi oleh ragam tenunan dari benang\nemas atau perak. Warna tersebut memiliki makna yaitu Putih untuk melambangkan Kesucian dan kejujuran, merah untuk melambangkan Kepahlawanan dan keberanian, kuning untuk melambangkan kaya /\nkesuburan, dan hitam untuk melambangkan duka.",
        "image": "https://miro.medium.com/max/700/1*CTMkARD0J2IcFcCVnY4gkg.jpeg"
      }
    },
    {
      "kode_provinsi": "prov-3",
      "nama_provinsi": "SUMATERA BARAT",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Coat_of_arms_of_West_Sumatra.svg/1200px-Coat_of_arms_of_West_Sumatra.svg.png",
      "tari_tradisional": {
        "name": "Tari Piring",
        "description": "Tari Piring adalah tarian tradisional Minangkabau yang menampilkan atraksi menggunakan piring. Para penari mengayunkan piring di tangan mengikuti gerakan-gerakan cepat yang teratur, tanpa satu pun piring\nyang terlepas dari tangan. Gerakannya diambil dari langkah-langkah dalam silat Minangkabau atau silek. Tarian ini diiringi oleh kombinasi alat musik talempong dan saluang. Tempo alunan musik awalnya lembut\ndan teratur, kemudian lama-kelamaan berubah menjadi lebih cepat.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Tari_Piring_di_Pesisir_Selatan.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Kampuang Nan Jauh di Mato",
        "description": "Kampuang Nan Jauh di Mato adalah salah satu lagu daerah yang berasal dari Sumatera Barat. Lagu Kampuang Nan Jauh di Mato ini sangat terkenal terutama di Sumatera Barat karena pada liriknya menceritakan\ntentang seorang perantau yang teringat akan kampung halamannya. Selain itu, liriknya juga menceritakan tentang keadaan kampung tersebut seperti keluarga yang ada di sana, penduduknya yang baik dan ramah,\ndan terdapat gunung di sekelilingnya. Karena teringat akan kampung halamannya, seperti merasa dipanggil untuk pulang.",
        "image": "https://assets.pikiran-rakyat.com/crop/0x0:0x0/x/photo/2020/08/18/483253367.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Bagonjong",
        "description": "Rumah Bagonjong adalah rumah adat khas Sumatera Barat. Rumah Bagonjong ini berbentuk persegi panjang dengan atap mirip seperti tanduk kerbau. Atapnya terbuat dari ijuk namun sangat kokoh. Rumah ini\nhanya memiliki satu tangga. Pada dindingnya, terdapat ukiran-ukiran yang menghiasi rumah tersebut seperti ukiran tumbuhan, bunga, buah, hingga akar berdaun.",
        "image": "https://i0.wp.com/perpustakaan.id/wp-content/uploads/2019/07/Rumah-Adat-Sumatera-Barat.jpg"
      },
      "senjata_khas": {
        "name": "Karih",
        "description": "Karih adalah salah satu senjata tradisional dari Provinsi Sumatera Barat. Karih atau keris ini terdiri dari empat buah bagian yaitu gembong, putiang, tunangan, dan mato keris. Gembong adalah bagian pegangan\nyang melengkung dan bermakna pemimpin suku adalah orang yang cerdas dan rendah hati. Putiang adalah besi yang menghubungkan gembong dengan bilah karih dan bermakna pemimpin suku harus sabar dan\nbertanggungjawab. Mato keris adalah bilah keris berliku dan  bermakna pemimpin suku akan berhati-hati dalam mengambil keputusan dan bersifat netral. Tunangan adalah sarung keris yang terbuat dari kayu.",
        "image": "https://i0.wp.com/tambahpinter.com/wp-content/uploads/2020/08/Karih-630x420.jpg"
      },
      "pakaian_adat": {
        "name": "Bundo Kanduang",
        "description": "Bundo Kanduang adalah pakaian adat dari Provinsi Sumatera Barat. Pakaian adat ini biasanya digunakan oleh wanita yang sudah menikah dan merupakan simbol akan peran penting seorang ibu di dalam keluarga.\nNama lain baju adat ini adalah Limpapeh Rumah Nan Gadang. Pakaian Bundo Kanduang terdiri atas Tengkuluk Ikek yaitu penutup kepala yang berbentuk seperti rumah adat gadang atau tanduk kerbau, Naju yaitu\nbaju kurung yang memiliki variasi warna biru, hitam, merah, atau lembayung dengan hiasan benang emas serta minsai di bagian tepinya, Kain Sarung atau Kodek Balapak yaitu bawahan yang dihiasi dengan sulaman\nbenang emas. Selain itu, pakaian ini memiliki berbagai perhiasan sebagai pelengkap namun perhiasan tersebut hanya digunakan oleh ketika upacara adat.",
        "image": "https://images.weddingku.com/images/upload/articles/images/ejy4dpo00vd872820161552.jpg"
      }
    },
    {
      "kode_provinsi": "prov-4",
      "nama_provinsi": "RIAU",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Coat_of_arms_of_Riau.svg/1200px-Coat_of_arms_of_Riau.svg.png",
      "tari_tradisional": {
        "name": "Tari Zapin",
        "description": "Tari Zapin adalah tarian yang berasal dari Riau. Tari Zapin adalah tarian khas Melayu yang diiringi lagu-lagu yang berasal dari negeri Yaman. Tari Zapin bermula dari sebuah tarian khusus bagian kalangan istana\ndi Kasultanan Yaman Timur Tengah di masa silam. Tari Zapin kemudian berkembang dan menjadi tarian yang digunakan sebagai dakwah Islamiyah melalui syair lagu-lagu Zapin yang dinyanyikan. Tarian ini\nditarikan secara berkelompok dengan musik pengiringnya yang terdiri dari dua alat musik utama, yakni gambus dan gendang kecil yang disebut marwas.",
        "image": "http://3.bp.blogspot.com/-YGHx16hyg58/VRTNL6oKbxI/AAAAAAAAANI/wvpBpJpsLfM/s1600/20130104-010436.jpg",
        "video": "OaEAEa2DhDY"
      },
      "lagu_daerah": {
        "name": "Soleram",
        "description": "Soleram adalah salah satu lagu daerah yang berasal dari Riau. Lagu Soleram ini sangat terkenal terutama di Riau dan sering dinyanyikan untuk anak-anak sebelum tidur. Lagunya yang merdu dan liriknya yang\nmudah diingat membuat lagu ini menjadi pengantar tidur untuk anak-anak. Lirik lagu Soleram menjelaskan tentang pesan yang disampaikan orangtua kepada anak-anaknya untuk menjaga kehormatan, menjaga\nharga diri, dan mempertahankan malu sebagai budaya. Selain itu, lirik lagu ini mengajarkan anak-anak untuk menyambung tali persaudaraan, menghindari perpecahan, dan melestarikan budaya yang mencerminkan\nbangsa Indonesia.",
        "image": "https://beritaku.id/wp-content/uploads/Istana-Siak-Indrapura-suara.com_.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Adat Selaso Jatuh Kembar",
        "description": "Rumah Adat Selaso Jatuh Kembar adalah rumah adat khas Riau. Rumah adat di provinsi ini sama dengan rumah adat di Riau. Fungsinya juga sama, sebagai tempat musyawarah ataupun rapat untuk\nkepentingan warga. Rumah adat ini berbentuk persegi panjang dan memiliki bangunan yang lebih rendah daripada ruang tengahnya.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Selaso-Jatuh-Kembar-Riau.jpg"
      },
      "senjata_khas": {
        "name": "Pedang Jenawi",
        "description": "Pedang Jenawi adalah salah satu senjata tradisional dari Provinsi Riau. Pedang Jenawi menjadi senjata tradisional pertama dan populer di Riau. Dulu, senjata ini sering digunakan oleh panglima perang kerajaan\nMelayu saat menghadapi musuh-musuhnya. Ukuran panjang pedang ini hanya sekitar 1 meter dan sering digunakan untuk tading jarak dekat. Ahli sejarah dan budayawan berpendapat, senjata ini berasal dari Jepang\nkuno namun mengalami akulturasi dengan budaya Melayu. Maka dari itu, bentuk dari Pedang Jenawi ini dinilai mirip dengan bentuk samurai Jepang.",
        "image": "https://www.sejarah-negara.com/wp-content/uploads/2018/05/Pedang-Jenawi-Riau.jpg.webp"
      },
      "pakaian_adat": {
        "name": "Pakaian Adat Melayu",
        "description": "Pakaian Adat Melayu adalah pakaian adat dari Provinsi Riau. Pakaian ini digunakan oleh masyarakat melayu dalam aktivitas sehari-hari seperti pergi berladang, bermain, ke laut, di rumah, dan kegiatan-kegiatan lain.\nPakaian ini dulunya dipergunakan saat pertemuan-pertemuan resmi oleh kerajaan dan dipakai hanya dalam acara penting atau acara resmi saja. Pakaian untuk laki-laki bernama Baju Kurung Cekak Musang  yang lengkap\ndengan kopiah dan kain samping yang terbuat dari kain-kain khas Riau. Pakaian untuk perempuan Baju Melayu Kebaya Laboh dan Baju Kurung Cekak Musang. Keduanya terbuat dari kain songket atau kain pilihan\nseperti Tenun Siak, Tenun Indragiri dan Tenun Trengganu.",
        "image": "https://kurio-img.kurioapps.com/19/11/20/1cfa80bb-a559-4d4c-b7e7-787a10149d5d.jpg"
      }

    },
    {
      "kode_provinsi": "prov-5",
      "nama_provinsi": "KEPULAUAN RIAU",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Coat_of_arms_of_Riau_Islands.svg/1200px-Coat_of_arms_of_Riau_Islands.svg.png",
      "tari_tradisional": {
        "name": "Tari Tandak",
        "description": "Tari Tandak atau disebut juga Tari Danding adalah tarian yang berasal dari Kepulauan Riau. Tarian ini memiliki makna sebagai tarian pergaulan dan ditarikan oleh kelompok pemuda dan pemudi. Dalam tarian ini,\npara penari akan menari dan menyanyi dalam bentuk pantun dan pantun tersebut saling berbalas. Selain sebagai hiburan, ternyata Tari Tandak dapat sekaligus mencari jodoh dikarenakan para penari berasal dari\nkampung lain. Terdapat gerakan bela diri dalam tarian ini dan tarian ini sering dipentaskan pada malam hari.",
        "image": "https://www.selasar.com/wp-content/uploads/2020/09/tari-tandak.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Segantang Lada",
        "description": "Segantang Lada adalah salah satu lagu daerah yang berasal dari Kepulauan Riau. Lagu Segantang Lada ini sangat terkenal terutama di Kepulauan Riau karena lagu ini memiliki makna tentang kerinduan akan\ntanah Riau. Segantang Lada adalah julukan untuk wilayah Riau, karena secara geografis Riau yang terdiri dari banyak pulau, digambarkan seperti Segantang Lada yang kecil-kecil namun banyak. Selain itu, dulu\nRiau menjadi penghasil lada terbesar di Nusantara pada abad ke-19. Lagu ini juga memiliki makna tentang kecintaan terhadap Riau. Walaupun berada di tempat yang jauh, tanah Riau akan selalu dirindukan\ndan dicintai.",
        "image": "https://www.andalastourism.com/wp-content/uploads/2021/04/Jembatan-Barelang-Batam-730x450.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Belah Bubung",
        "description": "Rumah Belah Bubung adalah rumah adat khas Kepulauan Riau. Rumah ini juga dikenal dengan nama Rumah Rabung atau Rumah Bubung Melayu. Rumah ini berbentuk rumah panggung dan memiliki tinggi 2 meter dari tanah dan ditopang oleh beberapa tiang penyangga. Rumah ini memiliki atap berbentuk seperti pelana kuda yang terdiri dari 4 bagian yaitu selasar, ruang induk, ruang penghubung dapur dan dapur.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Belah-Bubung-Kepulauan-Riau.jpg"
      },
      "senjata_khas": {
        "name": "Tumbuk Lado",
        "description": "Tumbuk Lado adalah salah satu senjata tradisional dari Provinsi Kepulauan Riau. Tumbuk Lado memiliki bentu seperti badik. Yang membedakan antara Tumbuk Lado dan Badik adalah bentuk Tumbuk Lada lebih ramping dengan\nbilah yang melengkung, seperti menunduk. Senjata ini dulu digunakan masyarakat Melayu untuk berburu dan mempertahankan diri dari musuh. Selain itu, karena bentuknya memiliki estetika yang indah, senjata ini juga\ndijadikan sebagai pelengkap baju adat pria Melayu terutama saat pesta pernikahan. Senjata Tumbuk Lado ini menjadi tanda kegagahan seorang pria.",
        "image": "https://asset.kompas.com/crops/UembnlntLOwWElCEEsme3UsXIOs=/0x55:796x586/750x500/data/photo/2021/05/18/60a37c00bb15c.png"
      },
      "pakaian_adat": {
        "name": "Kebaya Labuh dan Teluk Balangga",
        "description": "Kebaya Labuh dan Teluk Balangga adalah pakaian adat dari Provinsi Kepulauan Riau. Pakaian ini hanya memiliki satu jenis warna yang tidak mencolok dan dikenakan dalam kesehariannya. Selain itu, pakaian ini dikenakan juga dalam upacara\nresmi dan juga upacara adat, dan paling sering digunakan ketika upacara pernikahan. Pakaian untuk perempuan bernama Kebaya Labuh dan pakaian untuk laki-laki bernama Teluk Balangga. Komponen pakaian ini adalah baju\ndan juga celana yang panjang. Kerah pada pakaian ini tidak bisa dilipat karena berbentuk melingkar dan terdapat satu kancing di kerahnya. Pakaian untuk laki-laki bernama terbuat dari bahan kain satin, sedangkan pakaian untuk\nperempuan terbuat dari kain sutera. Pakaian ini pun dilengkapi dengan songko berbentuk segi empat yang dikenakan di kepala.",
        "image": "https://www.andalastourism.com/wp-content/uploads/2021/03/Cara-Membuat-Kebaya-Labuh-Teluk-Belanga.jpg"
      }

    },
    {
      "kode_provinsi": "prov-6",
      "nama_provinsi": "JAMBI",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/5/58/Lambang_Kota_Jambi.png",
      "tari_tradisional": {
        "name": "Tari Inai",
        "description": "Tari Inai adalah tarian yang berasal dari Jambi. Tari Inai adalah tarian yang digunakan untuk upacara pengantin dari masyarakat Melayu dan menjadi bagian penting dalam acara memberi tanda kepada pengantin.\nGerakan tari ini bersumber dari gerakan silat. Di Jambi, Tari inai dibawakan berpasang-pasangan. Namun ada pula yang dibawakan secara tunggal. Tarian ini ditampilkan oleh penari laki-laki dengan jumlah penari\nmaksimal 3 orang. Tarian ini ditampilkan pada malam hari oleh penari menggunakan perlengkapan berupa lilin.",
        "image": "https://static.republika.co.id/uploads/images/inpicture_slide/tari-inai-_200117191324-894.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Batanghari",
        "description": "Batanghari adalah salah satu lagu daerah yang berasal dari Jambi. Lagu Batanghari ini sangat terkenal terutama di Riau karena memiliki makna mengenai tanah Jambi itu sendiri. Batanghari adalah nama dari salah\nsatu sungai kebanggaan Jambi dan juga nama salah satu kabupaten di Jambi. Karena sungai yang indah tersebut, maka sang pencipta lagu menjadi terinspirasi dan membuat lagu ini. Makna dari lagu ini adalah\nuntuk meyakinkan orang-orang bahwa Jambi adalah negeri pantun. Dalam lagu ini pun terdapat pantun yang sangat mengesankan pada liriknya. Kebudayaan pada lagu ini juga dinilai selaras dengan alam.",
        "image": "https://cdn.idntimes.com/content-images/community/2019/11/26181951-1887844554859208-4785130601864757248-n-ceebeeab2f4caf2c7d81e6c5af9abd74.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Kajang Leko",
        "description": "Rumah Kajang Leko adalah rumah adat khas Jambi. Rumah ini biasa disebut rumah panggung Jambi. Ada 8 ruangan di dalam ruangan ini dan masing-masing ruangan memiliki fungsi berbeda. Ada ruangan untuk\ntempat beristirahat dan tempat penyimpanan air, untuk menerima tamu khusus laki-laki, untuk tempat tidur anak laki-laki, untuk kamar pengantin, untuk tempat tidur anak perempuan yang belum menikah, untuk\ntempat menerima tamu perempuan, dan untuk memasak.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Panggung-Jambi.jpg"
      },
      "senjata_khas": {
        "name": "Pedang Selangkeh",
        "description": "Pedang Selangkeh adalah salah satu senjata tradisional dari Provinsi Jambi. Pedang Selangkeh ini asli dari Suku Kerinci, suku yang ada di Jambi.  Dulu, senjata ini digunakan oleh para ksatria, pendekar, dan para\nprajurit Kerinci sejak masyarakat di Kerinci pertama kali mengenal dan mengetahui cara mengelola besi menjadi senjata adat. Pedang ini memiliki bentuk berupa pedang panjang yang sedikit melengkung, berujung\nruncing, dan terbuat dari besi berkualitas tinggi.",
        "image": "https://www.suarawajarfm.com/wp-content/uploads/2015/09/1181612.jpg"
      },
      "pakaian_adat": {
        "name": "Pakaian Melayu Jambi",
        "description": "Pakaian Melayu Jambi adalah pakaian adat dari Provinsi Jambi. Pakaian ini dinamakan juga baju Kurung Tanggung, karena baju tersebut memiliki lengan yang tanggung tapi panjangnya lebih dari siku, tidak sampai\npergelangan tangan. Laki-laki Melayu Jambi mengenakan lacak atau penutup kepala yang terbuat dari kain beludru merah dengan bagian dalamnya diberi kertas karton. Lacak umumnya akan dilengkapi dengan flora, yaitu\ntali runci di sisi kiri dan bungo runci di sisi kanan. Pakaian perempuan merupakan pakaian adat yang dipakai saat pernikahan dan hampir sama dengan pakaian pria yang berupa baju kurung yang terbuat dari bahan kain\nbeludru. Bedanya, pakaian perempuan dilengkapi dengan aksesoris seperti anting-anting atau antan yang bermotif kupu-kupu atau gelang banjar.",
        "image": "https://asset.kompas.com/crops/lJvjR8c7OlfUp0IdaEJmcc2tEVU=/0x9:874x591/750x500/data/photo/2021/02/28/603b29d66f2ee.jpg"
      }

    },
    {
      "kode_provinsi": "prov-7",
      "nama_provinsi": "BENGKULU",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Coat_of_arms_of_Bengkulu.png",
      "tari_tradisional": {
        "name": "Tari Gandai",
        "description": "Tari Gandai adalah tarian yang berasal dari Bengkulu. Tari Gandai adalah tari yang gerakannya berayun-ayun sambil mengembangkan dua tangan, seperti burung yang terbang di angkasa. Tarian ini diiringi oleh\nsebuah alat musik bambu tua yang diukir sehingga dapat memberikan suara yang indah. Alat musik itu bernama Serunai. Tari gandai berasal dari kata gando yang berarti ganda atau berpasangan. Tari gandai\nadalah sebuah tari tradisi suku pekal yang zaman dahulu saat berkumpul, bersukacita, menari dengan alunan serunai, dan berbalas pantun.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Tarian_Gandai_Asli_Mukomuko.jpg/1200px-Tarian_Gandai_Asli_Mukomuko.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Ikan Pais",
        "description": "Ikan Pais adalah salah satu lagu daerah yang berasal dari Bengkulu. Lagu Ikan Pais ini sangat terkenal terutama di Bengkulu karena memiliki makna mengenai ciri khas Bengkulu. Ikan Pais adalah ikan yang\ndijadikan sebuah masakan yang menjadi kuliner khas di tanah Bengkulu. Lagu ini menceritakan tentang betapa lezatnya Ikan Pais ini. Lagu ini juga menceritakan bagaimana bentuk dari kuliner Ikan Pais, Ikan Pais\ndimakan dengan nasi putih yang masih hangat, sambalnya yang pedas namun sangat enak, dan tidak sadar bahwa Ikan Pais ini sudah dimakan habis satu piring.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Front_gate_of_Fort_Marlborough%2C_Bengkulu_2015-04-19_02.jpg/800px-Front_gate_of_Fort_Marlborough%2C_Bengkulu_2015-04-19_02.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Bubungan Lima",
        "description": "Rumah Bubungan Lima adalah rumah adat khas Bengkulu. Rumah ini ditopang oleh tiang-tiang pada bagian penopang. Rumah ini digunakan sebagai tempat acara kemasyarakatan. Terdapat tangga di bagian\ndepan untuk memasuki rumah ini. Rumah Bubungan Lima ini terbat dari kayu yaitu kayu Medang Kemuning yang dianggap memiliki kualitas khusus.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Bubungan-Lima.jpg"
      },
      "senjata_khas": {
        "name": "Sewar",
        "description": "Sewar adalah salah satu senjata tradisional dari Provinsi Bengkulu. Senjata Sewar ini dibawa oleh pemuda-pemuda di daerah Bengkulu ketika berpergian dengan cara disarungkan dan diselipkan di belakang pakaian\nsang pemilik senjata. Mereka membawa Sewar dengan alasan untuk menjaga diri. Selain itu, Sewar juga dapat digunakan untuk menebas tanaman seperti rumput, bahkan sampai kayu yang tidak terlalu tebal. Sewar\nmirip dengan golok, bedanya Sewar lebih kecil ukurannya.",
        "image": "https://kitchenuhmaykoosib.com/wp-content/uploads/2020/05/Sewar-Senjata-Tradisional-Bengkulu.jpg"
      },
      "pakaian_adat": {
        "name": "Pakaian Melayu Bengkulu",
        "description": "Pakaian Melayu Bengkulu adalah pakaian adat dari Provinsi Bengkulu. Pakaian ini biasanya digunakan untuk busana pengantin dalam pernikahan, maupun sebagai busana tari tradisional untuk festival dan penyambutan\nacara khusus. Pakaian untuk perempuan adalah Baju Kurung lengan panjang berbahan kain beludru bertabur lempeng logam warna kuning emas. Umumnya warna baju yang dipilih adalah merah tua, lembayung, biru, dan\nhitam. Pakaian untuk pria sama seperti pakaian untuk perempuan, yang membedakannya hanya pada baju atau jas tertutup bertabur hiasan seperti lempengan koin. Selain itu juga mengenakan gelang, kalung sribulan, dan\nkalung emping. Bahkan untuk beberapa adat, pengantin pria tidak mengenakan topi melainkan mahkota atau sunting untuk pria.",
        "image": "https://i1.wp.com/sharingconten.com/wp-content/uploads/2020/02/Pakaian-adat-Bengkulu.jpg"
      }

    },
    {
      "kode_provinsi": "prov-8",
      "nama_provinsi": "KEPULAUAN BANGKA BELITUNG",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Coat_of_arms_of_Bangka_Belitung_Islands.svg/1200px-Coat_of_arms_of_Bangka_Belitung_Islands.svg.png",
      "tari_tradisional": {
        "name": "Tari Campak",
        "description": "Tari Campak adalah tarian yang berasal dari Bangka Belitung. Tari Campak adalah tarian yang menggambarkan keceriaan bujang dan dayang di Bangka Belitung dengan berbalas pantun. Tarian ini biasanya\ndibawakan setelah panen padi atau sepulang dari ume (kebun). Tarian ini berkembang pada masa pendudukan bangsa Portugis di Bangka Belitung. Dulu, tari ini hanya ditampilkan di acara tertentu. Namun, karena\nperkembangan, tari ini dapat digunakan sebagai hiburan dalam berbagai kegiatan seperti penyambutan tamu atau pada pesta pernikahan.",
        "image": "https://disbudpar.belitungtimurkab.go.id/sites/default/files/images/berita/tari%20campak%202.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Yok Miak",
        "description": "Yok Miak adalah salah satu lagu daerah yang berasal dari Kepulauan Bangka Belitung. Lagu Yok Miak ini sangat terkenal terutama di Bangka Belitung karena memiliki arti yang dalam. Lagu ini menceritakan\ntentang kebiasaan dan tradisi di Bangka Belitung untuk melakukan kegiatan gotong royong. Bangka Belitung memiliki semboyan \"Negeri Sepintu Sedulang\" dan gotong royong adalah bentuk dari semboyan itu.\nLagu ini menceritakan bahwa masyarakat di sini saling bekerjasama untuk mencapai suatu tujuan, dengan kerja yang keras, susah senang ditanggung bersama. Lagu ini biasa dinyanyikan pada saat panen\nlada terjadi.",
        "image": "https://i0.wp.com/medianesia.id/wp-content/uploads/2020/12/5e5788fb2f500.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Rakit",
        "description": "Rumah Rakit adalah rumah adat khas Kepulauan Bangka Belitung.  Saat ini, rumah Rakit banyak terdapat di pinggir sungai Musi dan ditempati oleh orang keturunan Tionghoa. Rumah Rakit iini\ndibuat dari bambu Manyan yang memiliki ukuran besar dan kuat serta kokoh. Banyak yang menganggap bangunan rumah adat ini sudah ada pada zaman kerajaan Sriwijaya.",
        "image": "https://i0.wp.com/perpustakaan.id/wp-content/uploads/2019/07/Rumah-Adat-Bangka-Belitung.jpg"
      },
      "senjata_khas": {
        "name": "Kedik",
        "description": "Kedik adalah salah satu senjata tradisional dari Provinsi Kepulauan Bangka Belitung. Kedik ini digunakan sebagai alat pertanian untuk membersihkan rumput yang mengganggu dalam kehidupan sehari-hari.\nSebelum pertimahan menjadi populer sebagai mata pencaharian, masyarakat Bangka Belitung yang bertempat tinggal di pedesaan kebanyakan berprofesi sebagai petani. Namun, Kedik juga dulunya dipakai sebagai\nsejata dan memiliki bentuk yang mirip clurit. Senjata ini karena ukurannya kecil dan ringan, menjadi alat yang digunakan oleh wanita.",
        "image": "https://www.sejarah-negara.com/wp-content/uploads/2018/05/Kedik-Senjata-Tradisional-Bangka-Belitung-1.jpg"
      },
      "pakaian_adat": {
        "name": "Paksian",
        "description": "Paksian adalah pakaian adat dari Provinsi Kepulauan Bangka Belitung. Pakaian ini biasanya dipakai untuk acara pernikahan. Pakaian pria di antaranya adalah Sorban atau yang biasa disebut masyarakat Bangka Belitung\nsebagai Sungkon dan baju putih dengan jubah panjang sebatas lutut berwarna merah dengan selempang berwarna hijau disebelah kanan dan mengenakan celana panjang beludru berwarna merah. Pakaian wanita di\nantaranya adalah baju Kurung Merah yang  terbuat dari bahan sutra atau beludru yang disebut baju Seting dan Kain Besusur, Kain Lasem, atau disebut juga dengan Kain Cual. Pada kepala mempelai wanita biasanya memakai\nmahkota yang bernama Paksian.",
        "image": "https://www.99.co/blog/indonesia/wp-content/uploads/2020/12/paksian.jpg"
      }
    },
    {
      "kode_provinsi": "prov-9",
      "nama_provinsi": "SUMATERA SELATAN",
      "kode_pulau": "1",
      "image": "https://www.sumselprov.go.id/userfiles/images/logosumsel.png",
      "tari_tradisional": {
        "name": "Tari Gending Sriwijaya",
        "description": "Tari Gending Sriwijaya adalah tarian yang berasal dari Sumatera Selatan. Tarian ini tarian kolosal peninggalan kerajaan Sriwijaya dan hanya dipentaskan oleh orang yang ada di dalam kerajaan sebagai tari\npenyambutan bagi tamu kerajaan. Saat ini, tarian ini dipentaskan oleh masyarakat Palembang dalam berbagai acara, seperti pernikahan, pertemuan-pertemuan pemerintahan, dan pertunjukkan untuk pengenalan\nbudaya. Tarian ini ditarikan oleh 9 orang penari perempuan. Sembilan penari tersebut merupakan gambaran dari sembilan sungai yang ada di Sumatera Selatan.",
        "image": "https://indonesiakaya.com/wp-content/uploads/2020/10/tari_gending_sriwijaya_1200.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Dek Sangke",
        "description": "Dek Sangke adalah salah satu lagu daerah yang berasal dari Sumatera Selatan. Lagu Dek Sangke ini sangat terkenal terutama di Sumatera Selatan karena memiliki pesan moral dalam liriknya. Lagu ini menjelaskan\ntentang kebohongan yang dilakukan oleh seseorang, satu baitnya memiliki arti \"tidak disangka cempedak berbuah nangka\". Kebohongan yang dilakukan oleh siapapun orangnya, pasti akan ketahuan pada akhirnya.\nLagu ini memberi pesan bahwa kita sebagai manusia janganlah berbohong dengan alasan apapun. Kebohongan yang kita lakukan akan memberikan dampak buruk untuk diri sendiri dan akan terbongkar pada akhirnya.",
        "image": "https://assets-a1.kompasiana.com/items/album/2021/04/25/cccc-6084c88c8ede481a4c4a04b2.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Limas",
        "description": "Rumah Limas adalah rumah adat khas Sumatera Selatan. Rumah ini berbentuk limas, itulah mengapa dinamakan Rumah Limas. Rumah ini memiliki tingkatan bangunan yang dikenal dengan \"bengkilas” dan\ndigunakan untuk para tamu yang datang ke sana untuk singgah di teras atau ruangan atas. Terdapat 5 ruangan yang disebut “kekijing” yang menjelaskan simbol dari lima jenjang kehidupan manusia, usia, bakat, jenis,\npangkat, dan martabat.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Limas-Sumatera-Selatan.jpg"
      },
      "senjata_khas": {
        "name": "Skin",
        "description": "Skin adalah salah satu senjata tradisional dari Provinsi Sumatera Selatan. Skin ini biasa juga disebut dengan jembio, raji ayam, atau rambai ayam karena bentuknya yang mirip dengan ekor (taji) ayam jantan.\nMasyarakat Sumatera Selatan percaya bahwa senjata ini memiliki kedudukan penting dan dianggap keramat. Jika dilihat dari sisi budayanya, senjata Skin memiliki beberapa simbol kemanusiaan yaitu kesabaran,\nketelitian, ketekunan, dan lain-lain. Senjata ini terbuat dari baja berkualitas tinggi dan berbentuk melengkung.",
        "image": "https://www.selasar.com/wp-content/uploads/2020/08/skin-senjata-tradisional-sumatera-selatan.jpg"
      },
      "pakaian_adat": {
        "name": "Aesan Gede",
        "description": "Aesan Gede adalah pakaian adat dari Provinsi Sumatera Selatan. Pakaian ini sering dijumpai pada acara pernikahan, yaitu munggah. Menurut para ahli budaya, arti dari Aesan adalah hiasan, sedangkan Gede yang berarti\nkebesaran. Jadi, Aesan Gede adalah pakaian kebesaran. Pakaian untuk perempuan terdiri atas Bungo Rampai, Gandik, Gelung Malang, dan lain-lain pada kepala, lalu Teratai, Kalung Kebo Munggah, dan Songket pada\nbagian tubuh, lalu berbagai macam gelang pada bagian tangan, dan Cenela untuk bagian kaki. Pakaian untuk pria terdiri atas Kalung Kebo Munggah dan Slempang Sawit pada bagian tubuh, lalu berbagai macam gelang\npada bagian tangan, dan Celano Sutra dan Cenela untuk celana. Celana ini berbahan sutra yang mempunyai motif ukel yaitu simbol berupa sifat lemah lembut.",
        "image": "https://seringjalan.com/wp-content/uploads/2020/05/Baju-Aesan-Gede-Baju-adat-sumatera-selatan.jpg"
      }
    },
    {
      "kode_provinsi": "prov-10",
      "nama_provinsi": "LAMPUNG",
      "kode_pulau": "1",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Lampung_coa.png",
      "tari_tradisional": {
        "name": "Tari Sigeh Pengunten",
        "description": "Tari Sigeh Pengunten adalah tarian yang berasal dari Lampung. Tarian ini adalah salah satu tari kreasi baru hasil pengembangan dari Tari Sembah. Walaupun tarian ini tari ini adaptasi antara klasik dan modern,\nnamun busana atau kostum dan segala aksesoris serta musik pengiring dalam tarian ini tidak ada perubahan. Tari Sigeh Pengunten digunakan untuk menunjukkan keramahtamahan tuan rumah kepada para tamu\ndan seluruh undangan yang menghadiri sebuah acara di Lampung. Selain itu, tarian ini juga sering digunakan dalam acara-acara adat dan acara pernikahan.",
        "image": "https://seringjalan.com/wp-content/uploads/2020/04/indonesiakaya.com_.jpg",
        "video": "vzit4ewJdb8"
      },
      "lagu_daerah": {
        "name": "Cangget Agung",
        "description": "Cangget Agung adalah salah satu lagu daerah yang berasal dari Lampung. Lagu Cangget Agung ini sangat terkenal terutama di Lampung karena lagu ini adalah lagu yang wajib dan sudah menjadi tradisi. Lagu ini\nmenjelaskan tentang upacara perkawinan masyarakat adat Lampung sebagai media untuk menanamkan nilai-nilai budaya Lampung pada generasi mudanya. Selain itu, dalam lagu ini menjelaskan pernikahan antara\ndua orang harus dibarengi dengan penuh tanggungjawab, dan juga mengajak anak muda Lampung untuk melestarikan adat istadat sebagai identitas daerah mereka.",
        "image": "https://asset.kompas.com/crops/kExBWIsMbYB37CCwfCCZzJJM2Qc=/0x0:1024x683/750x500/data/photo/2019/05/21/89768046.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Nuwo Sesat",
        "description": "Rumah Nuwo Sesat adalah rumah adat khas Lampung. Rumah ini digunakan sebagai tempat pertemuan adat bagi penyimbang (purwatin) untuk musyawarah. Rumah Nuwo Sesat ini berbentuk panggung dengan\nukurannya yang sangat besar. Namun di masa sekarang ini, rumah ini berukuran lebih kecil dari aslinya. Pada sisi bangunan rumah ini terdapat ornamen yang dianggap khas dan berbeda.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Nowou-Sesat-Lampung.jpg"
      },
      "senjata_khas": {
        "name": "Terapang",
        "description": "Terapang adalah salah satu senjata tradisional dari Provinsi Lampung. Terapang ini dulunya digunakan para bangsawan dan lingkungan kerajaan untuk melindungi diri dari serangan lawan. Senjata ini sudah dipakai\nsejak kekuasaan Kerajaan Tulang Bawang, sejak abad ke-12 Masehi. Saat ini, senjata Terapang digunakan untuk upacara adat Lampung, pelengkap busana pria. Senjata ini menjadi lambang tanggungjawab pria\ndalam menjaga kesemalatan istrinya.",
        "image": "https://i0.wp.com/perpustakaan.id/wp-content/uploads/2020/02/Senjata-Tradisional-Lampung-Terapang.jpg"
      },
      "pakaian_adat": {
        "name": "Tulang Bawang",
        "description": "Tulang Bawang adalah pakaian adat dari Provinsi Lampung. Pakaian ini memiliki tradisi ketimuran dengan model baju tertutup dan menjunjung tinggi nilai kesopanan. Pakaian untuk pria terdiri atas atasan putih berlengan\npanjang dengan bawahan celana berwarna sama, can lilitan sarung di pinggang hingga sepanjang lutut dengan dominasi warna merah dan emas. Pakaian untuk perempuan terdiri atas kebaya berwarna putih yang terbuat\ndari bahan brokat yang dapat memiliki lengan bervariasi pendek maupun panjang, sarung bermodel rok panjang yang coraknya sama dengan kaum pria untuk bawahan, dan perhiasan yang beragam mulai dari mahkota di\nkepala, anting, kalung, gelang, dan cincin.",
        "image": "https://i0.wp.com/rimbakita.com/wp-content/uploads/2020/07/baju-tulang-bawang.jpg"
      }
    },

    {
      "kode_provinsi": "prov-11",
      "nama_provinsi": "BANTEN",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Coat_of_arms_of_Banten.png/1200px-Coat_of_arms_of_Banten.png",
      "tari_tradisional": {
        "name": "Tari Ngabalukbuk",
        "description": "Tari Ngabalukbuk adalah tarian yang berasal dari Banten. Tarian ini menceritakan konflik dalam kehidupan manusia, karena keserakahan dan ketidakadilan. Konflik ini timbul karena sebuah\nhal yaitu air. Tarian ini menceritakan hiruk pikuk kehidupan masyarakat dalam tradisi mengalirkan air dari sumber mata air yang berada di gunung sampai ke kampung atau persawahan\ndengan mengunakan ruas bambu yang disambung memanjang. Selain konflik, dalam tari ini terdapat kebersamaan, gotong royong dan kepedulian terhadap lingkungan dan alam yang\nsenantiasa patut dilestarikan agar tetap terjaga.",
        "image": "http://paradetarinusantara.com/wp-content/uploads/2019/06/Parade-Tari-Nusantara-2018-Ngabalukbuk-Banten-005.jpg",
        "video": "gD-5gCKYYLc"
      },
      "lagu_daerah": {
        "name": "Jereh Bu Guru",
        "description": "Jereh Bu Guru adalah satu lagu daerah yang berasal dari Banten. Lagu Jereh Bu Guru ini sangat terkenal terutama di Banten karena lagu ini adalah lagu yang menceritakan tentang sebuah\nkerhormatan. Jereh Bu Guru memiliki arti yaitu \"kata bu guru\" dan dalam lirik lagu ini terdapat nasihat atau pesan bahwa anak-anak harus selalu menghormati, berbakti, dan mendengarkan perkataan orang\nyang lebih tua. Selain itu, pesan yang ingin disampaikan oleh lagu ini adalah agar murid-murid belajar dengan rajin dan tekun, agar di masa depan dapat menjadi manusia yang berilmu dan berguna\nbagi sekitarnya.",
        "image": "https://cdn.wonderin.id/statics/assets/uploads/lesung_ujung%20kulon%201%20(1).jpg",
        "video": "Gfx1aasCVI8"
      },
      "rumah_adat": {
        "name": "Rumah Baduy",
        "description": "Rumah Baduy adalah rumah adat khas Banten. Rumah ini adalah rumah yang penghuninya adalah Suku Badui. Rumah ini berbentuk Julang Ngapak atau seperti rumah panggung dengan bahan bambu.\nRumah ini adalah simbol kesederhanaan masyarakat setempat dan digunakan untuk tempat berlindung dan mendapat kenyamanan. Selain itu, Rumah Badui ini dikenal dengan kekeluargaannya karena\ndibuat dengan gotong royong.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Badui-Banten.jpg"
      },
      "senjata_khas": {
        "name": "Bedog Banten",
        "description": "Bedog Banten adalah salah satu senjata tradisional dari Provinsi Banten. Begog menjadi alat perkakas yang digunakan untuk pekerjaan pertanian di ladang atau sawah. Senjata ini digunakan untuk\nmenebang pohon dan bambu, membelah kelapa, untuk keperlauan dapur, dan sebagainya. Pada zaman dulu, senjata Bedog ini dipakai para jawara dari Banten untuk perlindungan diri.",
        "image": "https://www.sejarah-negara.com/wp-content/uploads/2018/05/Bedog-1.gif.webp"
      },
      "pakaian_adat": {
        "name": "Pangsi",
        "description": "Pangsi adalah pakaian adat dari Provinsi Banten. Pakaian Pangsi umumnya dipakai oleh laki-laki untuk orang Sunda. Pakaian ini digunakan sebagai busana latihan silat tradisional yang ada di Banten karena\nsilat menjadi salah satu budaya yang cukup populer dan sering digelar di Banten. Warna baju Pangsi identik dengan hitam, namun tidak menutup kemungkinan dengan warna-warna lain menyesuaikan acara\natau kegunaan Pangsi itu sendiri. Atasan pakaian adat ini dikenal dengan sebuatan Salontreng. Atasan baju Pangsi memiliki kancing dengan jumlah enam buah yang melambangkan rukun iman atau lima\nkancing yang melambangkan rukun Islam. Pakaian ini dilengkapi dengan sendal selop dan ikat kepala khas Banten yang disebut totopong.",
        "image": "https://blogkulo.com/wp-content/uploads/2020/04/Pangsi-Busana-Tradisional-Jawa-Barat.jpg"
      }
    },
    {
      "kode_provinsi": "prov-12",
      "nama_provinsi": "DKI JAKARTA",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Coat_of_arms_of_Jakarta.svg/1200px-Coat_of_arms_of_Jakarta.svg.png",
      "tari_tradisional": {
        "name": "Tari Lenggang Nyai",
        "description": "Tari Lenggang Nyai adalah tarian khas Jakarta yang diambil dari sebuah cerita rakyat. Banyak pesan dan makna yang ingin disampaikan melalui tarian ini, terutama pesan mengenai kebebasan\nwanita. Tari Lenggang Nyai dikatakan bersumber dari cerita rakyat Betawi, yaitu Nyai Dasimah yang memperjuangkan kebebasannya. Dalam pertunjukannya, penari menari dengan gerakan yang\nlincah yang menggambarkan keceriaan dan keluwesan gadis Betawi. Kelincahan tersebut terlihat dari gerak tubuh, kaki, dan tangan para penari yang bergerak cepat tetapi tetap harmonis dengan musik.",
        "image": "https://www.goodnewsfromindonesia.id/uploads/post/large-maxresdefault-1-4d2a0786063540dff664d84bfe0d9d07.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Kicir-Kicir",
        "description": "Kicir-Kicir adalah salah satu lagu daerah yang berasal dari DKI Jakarta. Lagu Kicir-Kicir ini sangat terkenal terutama di Jakarta karena lagu ini muncul dari tradisi pantun nusantara, terutama pengaruh dari\npantun melayu dan syair. Pada lirik lagu ini memiliki rima dan suku kata yang sama seperti pantun dan syair dan arti liriknya yang ingin menghibur pendengar. Lagu ini memberi nasehat agar manusia selalu\nbersemangat dalam menjalani kehidupan dan rajin berusaha dan bekerja demi kehidupan yang lebih baik serta berguna bagi sesama.",
        "image": "https://blog.roomme.id/wp-content/uploads/2020/08/ilustrasi-monas-2_ratio-16x9-1.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Kebaya",
        "description": "Rumah Kebaya adalah rumah adat khas DKI Jakarta. Rumah ini memiliki ciri khasnya ada pada atapnya. Atapnya memiliki bentuk menyerupai pelana yang terlipat. Rumah ini pun terdapat lipatan-lipatan\nkebaya jika dilihat dari tampak samping. Ornamen yang dipakai di rumah ini memiliki tema yang khas milik suku Betawi. Rumah Kebaya masih ditemukan di daerah Jakarta dengan kondisi baik karena\nwarga sekitar merawatnya dengan baik.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Kebaya-DKI-Jakarta.jpg"
      },
      "senjata_khas": {
        "name": "Golok",
        "description": "Golok adalah salah satu senjata tradisional dari Provinsi DKI Jakarta. Golok tepatnya adalah senjata asal Betawi yang terkenal. Senjata ini sering dijadikan sebagai pelengkap busana adat betawi untuk kaum\npria, dilselipkan di ikat pinggang berwarna hijau. Snejata ini pula dipakai saat bekerja atau berpergian dengan alasan sebagai alat untuk perlindungan diri. Masyarakat Betawi memiliki golok yang berbeda\nsesuai dengan kebutuhan. Golok Gablongan untuk bekerja dan Golok Simpenan untuk menyembelih hewan, atau juga perlindungan diri.",
        "image": "https://sarapanmatahari.files.wordpress.com/2017/09/golok-seliwa-e1504970881592.jpg?w=662&h=399"
      },
      "pakaian_adat": {
        "name": "Pakaian Adat Betawi",
        "description": "Pakaian Adat Betawi adalah pakaian adat dari Provinsi DKI Jakarta. Nama pakaian adat ini adalah Baju Sadariah yang baju yang dipakai oleh  laki-laki Betawi dan Baju Kurung dipakai oleh perempuan. Baju\nSadariah merupakan baju resmi tradisional Betawi yang terdiri atas baju koko sadariyah atau sering disebut juga baju gunting Cina, terompah, dan berpeci hitam atau merah. Potongan baju Koko disebut\ngunting Cina karena bahan pakaian tersebut dianggap oleh masyarakat Betawi terbuat dari bahan katun berwarna krem, atau kuning muda. Baju Kurung wanita terdiri atas busana kebaya lengan panjang\ndan kain yang dipakai sampai ke mata kaki, alas kaki atau selop serta kerudung.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_jakarta.png?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-13",
      "nama_provinsi": "JAWA BARAT",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Coat_of_arms_of_West_Java.svg/220px-Coat_of_arms_of_West_Java.svg.png",
      "tari_tradisional": {
        "name": "Tari Merak",
        "description": "Tari Merak adalah tarian indah yang mengekspresikan keanggunan gerak dan keindahan tata busana yang diambil dari kehidupan burung merak yang terlahir di Tanah Pasundan. Tari ini lebih\nmenggambarkan tingkah laku burung merak jantan yang sering menunjukkan keindahan warna-warni bulu ekornya untuk menarik perhatian. Dalam pertunjukannya, tari ini dimainkan oleh tiga penari atau\nlebih secara berkelompok dan menunjukkan tata busana yang dikenakan yang memiliki motif seperti bulu burung merak.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20tari/6.%20merak.jpeg?raw=true",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Tokecang",
        "description": "Tokecang adalah salah satu lagu daerah yang berasal dari Jawa Barat. Dalam bahasa Sunda, Tokecang adalah singkatan dari tokek makan kacang. Lagu Tokecang ini sangat terkenal terutama di Jawa\nBarat karena memiliki nada dan irama yang menyenangkan untuk didengar. Pada lirik lagu ini menjelaskan tentang tokek yang memakan banyak kacang. Lirik lagu ini menggambarkan tentang sikap rakus\nmanusia. Sebagai manusia, kita tidak boleh bersikap rakus, mementingkan diri sendiri, dan saling berbagi kepada sesama karena manusia adalah makhluk sosial.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/jabar.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Keraton Kasepuhan Cirebon",
        "description": "Rumah Keraton Kasepuhan Cirebon adalah rumah adat khas Jawa Barat. Rumah ini berdiri pada tahun 1529 yang mana pendirinya adalah Pangeran Cakrabuana dan rumah ini adalah hasil perluasan dari\nkeraton sebelumnya Rumah ini memiliki pintu gerbang utama keraton yang cukup unik. Di dalam gerbang, terdapat kreteg pangrawitan dan setelah itu tempat bangunan keraton yang aslinya.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Kasepuhan-Cirebon-Jawa-Barat.jpg"
      },
      "senjata_khas": {
        "name": "Kujang",
        "description": "Kujang adalah salah satu senjata tradisional dari Provinsi Jawa Barat. Kujang dianggap sebagai benda yang sakral, atau dipercaya memiliki kekuatan dari dewa. Senjata ini memiliki fungsi sebagai senjata\nperang dengan simbol keagungan dan pemerintahan. Untuk saat ini, senjata Kujang sering dijadikan sebagai alat untuk pajangan dinding oleh masyarakat Sunda. Namun, jika ingin menggunakan senjata\nini untuk kegiatan sehari-hari, maka senjata Kujang dapat digunakan sebagai alat untuk memangkas semak belukar.",
        "image": "https://asset.kompas.com/crops/nOL4UNVsVkPeovnmKVoZyywFS_Q=/300x146:667x390/750x500/data/photo/2021/05/17/60a234db2f46e.png"
      },
      "pakaian_adat": {
        "name": "Kebaya Sunda",
        "description": "Kebaya Sunda adalah pakaian adat dari Provinsi Jawa Barat. Kebaya Sunda biasanya memiliki warna-warna yang cerah seperti putih, merah marun, dan ungu muda. Kebaya sunda ini hampir sama dengan\nkebaya dari Jawa Tengah dan Jawa Timur, yang membedakan terdapat pada bentuk bagian lehernya. Pakaian ini dilengkapi dengan kain jarik sebagai bawahan dengan motif batik yang bermacam-macam\nkhas Jawa Barat. Selain itu terdapat aksesoris seperti tusuk konde, giwang, kalung, gelang, cincin, dan aksesoris lainnya. Kebaya Sunda ini pakaian adat yang dipakai oleh rakyat biasa hingga kaum menengah.\nMeskipun sama-sama menggunakan kebaya, jika corak dan bahannya berbeda maka itu tetap menjadi penanda status sosial seseorang.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_jabar.jpg?raw=true"
      }
    },

    {
      "kode_provinsi": "prov-14",
      "nama_provinsi": "JAWA TENGAH",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Coat_of_arms_of_Central_Java.svg/1200px-Coat_of_arms_of_Central_Java.svg.png",
      "tari_tradisional": {
        "name": "Tari Gambyong",
        "description": "Tari Gambyong adalah tarian yang berasal dari Jawa Tengah. Tari Gambyong merupakan salah satu bentuk tarian Jawa klasik yang berasal-mula dari wilayah Surakarta dan biasanya dibawakan\nuntuk pertunjukan atau menyambut tamu. Namun, awalnya tari gambyong digunakan pada upacara ritual pertanian yang bertujuan untuk kesuburan padi dan perolehan panen yang melimpah.\nTari ini tidak hanya terdiri dari satu tarian saja melainkan terdiri dari bermacam-macam koreografi. Tarian yang paling dikenal adalah Tari Gambyong Pareanom (dengan beberapa variasi) dan\nTari Gambyong Pangkur.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20tari/tari%20gambyong%20(jateng).jpg?raw=true",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Cublak Cublak Suweng",
        "description": "Cublak Cublak Suweng adalah satu lagu daerah yang berasal dari Jawa Tengah. Lagu Cublak Cublak Suweng ini sangat terkenal terutama di Jawa Tengah karena lagu ini adalah lagu permainan anak-anak.\nLagu ini memilik arti yang baik yaitu tentang kebahagiaan sejati. Kebahagiaan yang murni atau sejati berasal dari diri yang tidak terlalu mencintai harta benda duniawi, rendah hati, tidak merendahkan antara\nsesama manusia, dan juga berlaku memakai rasa dan nurani dalam dirinya. Selain itu, pesan yang diberikan adalah kita sebagai manusia tidak boleh bersifat serakah. Ketika sudah memiliki kebahagiaan\nsejati, maka manusia akan menjalani hidupnya dengan penuh senyum dan tawa.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/jateng.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Joglo",
        "description": "Rumah Joglo adalah rumah adat khas Jawa Tengah. Rumah ini adalah rumah yang sangat terkenal karena masih sering dijumpai di beberapa tempat. Ada beberapa ruangan dalam rumah ini. Ruangan\ndepan disebut dengan pendopo dan berfungsi sebagai tempat menerima tamu yang datang ke sana. Ornamen rumah ini memiliki corak sentuhan kejawaan yang khas karena mengambil dari tema\nbudaya Suku Jawa.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Joglo-Jawa-Tengah.jpg"
      },
      "senjata_khas": {
        "name": "Keris",
        "description": "Keris adalah salah satu senjata tradisional dari Provinsi Jawa Tengah. Keris adalah salah satu senjata yang sangat terkenal, bahkan sejak zaman dulu keris adalah simbol yang melambangkan kekuatan\nbaik untuk perempuan atau laki-laki. Senjata ini memiliki daya serang yang dapat melumpuhkan lawan dari jarak dekat. Kekuatan dari senjata ini tidak bisa dianggap remeh. Keris tidak hanya menjadi\nsenjata yang terdapat di daerah Jawa, namun juga di beberapa daerah yang lainnya.",
        "image": "https://asyraafahmadi.com/wp-content/uploads/2018/06/Keris-Jawa-Tengah-1.jpg"
      },
      "pakaian_adat": {
        "name": "Kebaya Jawa",
        "description": "Kebaya Jawa adalah pakaian adat dari Provinsi Jawa Tengah. Pakaian khusus untuk pria bernama Jawi Jangkep. Jawi Jangkep terdiri atas atasan dengan motif bunga di bagian tengah dan beskap di bagian\ndalam. Beskap terbuat dari bahan tebal dengan warna polos. Warna beskap umumnya gelap, seperti hitam, hijau tua, biru tua, merah bata, dan lainnya.  Jawi Jangkep menggunakan kain jarik panjang yang\ndililit dari pinggang hingga mata kaki dengan Keris diselipkan di belakang sebagai makna bahwa manusia harus mampu menolak godaan jahat. Jawi Jangkep dilengkapi dengan Blangkon dan sendal selop.\nPakaian khusus untuk wanita bernama Kebaya. Kebaya dipadukan dengan batik atau kain panjang yang dilingkarkan mulai dari pinggang hingga mata kaki. Pemakaian kebaya harus dilengkapi dengan\nsanggul atau konde rambut. Selain itu, ditambah aksesoris seperti cincin, kalung, gelang, dan anting dan sandal selop perempuan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_jateng.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-15",
      "nama_provinsi": "JAWA TIMUR",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Coat_of_arms_of_East_Java.svg/220px-Coat_of_arms_of_East_Java.svg.png",
      "tari_tradisional": {
        "name": "Tari Remo",
        "description": "Tari Remo adalah tarian untuk penyambutan tamu yang ditampilkan oleh satu orang atau lebih. Menurut sejarahnya, tarian ini merupakan tari yang khusus dibawakan oleh penari laki-laki. Pertunjukan Tari\nRemo umumnya menampilkan kisah pangeran yang berjuang dalam sebuah medan pertempuran. Tetapi tarian ini berkembang menjadi ditarikan oleh perempuan, sehingga memunculkan gaya tarian yang\nlain yaitu Remo Putri. Tarian ini dicirikan dengan gerakan kaki yang rancak dan dinamis dan gerakan selendang atau sampur, gerakan anggukan dan gelengan kepala, ekspresi wajah, dan kuda-kuda\nmembuat tarian ini semakin atraktif.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20tari/5.%20remo.jpg?raw=true",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Rek Ayo Rek",
        "description": "Rek Ayo Rek adalah salah satu lagu daerah yang berasal dari Jawa Timur. Lagu Rek Ayo Rek ini sangat terkenal terutama di Jawa Timur karena memiliki nada dan irama yang menyenangkan untuk\ndidengar. Pada lirik lagu ini terdapat berupa ajakan kepada teman-teman untuk jalan-jalan bersama. Walaupun tidak memiliki uang, namun dapat bersenang-senang bersama. Lirik lagu ini menggambarkan\nsebuah pertemanan antar sesama manusia. Pertemanan yang erat tidak harus berdasarkan harta, rasa kebersamaan adalah hal yang penting dalam sebuah pertemanan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/jatim.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Joglo Sitobondo",
        "description": "Rumah Joglo Sitobondo adalah rumah adat khas Jawa Timur. Rumah ini berbeda dengan Rumah Joglo dari Jawa Tengah walaupun pada beberapa bagian memiliki kemiripan. Rumah ini digunakan\nsebagai tempat tinggal dan untuk peninggalan bersejarah. Rumah ini memiliki ciri khas yaitu ukiran dan bentuknya yang sederhana namun memiliki makna seni yang tinggi.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Joglo-Situbondo-Jawa-Timur.jpg"
      },
      "senjata_khas": {
        "name": "Clurit",
        "description": "Clurit adalah salah satu senjata tradisional dari Provinsi Jawa Timur, tepatnya di suku Madura. Clurit adalah senjata yang tidak dapat terpisah dari tradisi dan kebudayaan Madura hingga saat ini. Senjata\nini dijadikan sebagai alat yang digunakan petani untuk memotong rumput atau mencari makanan hewan ternak. Sebutan lain dari Clurit adalah Sabit. Senjata Clurit ini dulunya menjadi alat yang digunakan\nseorang tokoh yang ikut serta dalam memperjuangkan Indonesia dari penjajah Belanda.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/clurit_jatim.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Pesa'an",
        "description": "Pesa'an adalah pakaian adat dari Provinsi Jawa Timur. Awalnya pakaian ini adalah pakaian yang sering digunakan bagi masyarakat Madura. Namun baju Pesa'an justru menjadi ikon Jawa Timur. Baju\nPesa'an umumnya digunakan untuk laki-laki. Baju dalam untuk Pesa'an adalah kaus bergaris merah dan putih atau merah dan hitam. Kemudian untuk baju luarnya berbentuk jas dengan warna jas umumnya\nhitam. Bawahannya menggunakan celana longgar yang sering disebut gomboran. Untuk pakaian Pesa'an wanita adalah kebaya dan sarung. Dalaman kebaya Jawa Timur yaitu dalamab dengan warna-warna\nyang kontras seperti hijau, merah muda, atau biru. Wanita memakai aksesoris seperti cucuk sisir dan cucuk dinar untuk hiasan rambut yang terbuat dari logam emas, penutup kepala yang disebut leng oleng\ndari kain, anting emas, kalung brondong, gelang, dan cicin bermotif tebu saeres. Terakhir adalah penggel, hiasan pergelangan kaki dan sendal selop.",
        "image": "https://berbol.co.id/wp-content/uploads/2019/05/pakaian-adat-madura.jpg"
      }
    },
    {
      "kode_provinsi": "prov-16",
      "nama_provinsi": "YOGYAKARTA",
      "kode_pulau": "2",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Coat_of_arms_of_Yogyakarta.svg/1200px-Coat_of_arms_of_Yogyakarta.svg.png",
      "tari_tradisional": {
        "name": "Tari Serimpi",
        "description": "Tari Serimpi adalah tarian yang berasal dari Yogyakarta. Tarian ini adalah tarian sakral yang dahulu hanya dipentaskan oleh kalangan internal keraton. Kata serimpi memiliki makna yaitu impi atau\nmimpi. Penonton seolah berada di dalam mimpi ketika melihat penampilan tari ini. Tarian ini ditarikan oleh empat orang karena nama Serimpi sering dikaitkan dengan unsur dalam kehidupan\nmanusia yang mewakili 4 orang penari, yaitu grama (api), angin (udara), toya (air), dan bumi (tanah). Tarian ini memiliki mengajarkan agar manusia dapat mengandalkan diri dan segala tingkah laku\nmanusia mengandung jalan kebaikan dan kesejahteraan.",
        "image": "https://pariwisataindonesia.id/wp-content/uploads/2020/10/tari-serimpi-by-twitter.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Suwe Ora Jamu",
        "description": "Suwe Ora Jamu adalah salah satu lagu daerah yang berasal dari Yogyakarta. Lagu Suwe Ora Jamu ini sangat terkenal terutama di Yogyakarta dan daerah sekitar Jawa karena lagu ini adalah lagu permainan\nanak-anak. Namun, lagu ini juga dinyanyikan oleh orang dewasa. Lagu ini menceritakan tentang pertemuan beberapa sahabat yang sudah lama berpisah. Tidak disangka, yang mereka dapat setelah\npertemuan itu adalah rasa kekecewaan. Namun, rasa kecewa itu tidak ditunjukkan. Lagu ini menunjukkan rasa bahagia karena pertemuan itu dan juga bahagia karena orang yang ditemui sudah\nbertambah pintar.",
        "image": "https://asset.kompas.com/crops/n9KBRpzeM15wxG540aeEQzlWaQo=/49x78:924x662/750x500/data/photo/2020/04/12/5e931d94dc081.jpg",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Bangsal Kencono",
        "description": "Rumah Bangsal Kencono adalah adalah rumah adat khas Yogyakarta. Jika dilihat dari arstitekturnya, rumah ini memang mirip dengan rumah Joglo dari Jawa Tengah. Rumah ini memiliki ukuran yang lebih\nluas, lebar, dan juga besar. Arsitektur dari bangunan ini dipengaruhi oleh gaya bangunan Portugis, Belanda, dan Cina namun memiliki desain adat Jawa. Dindingnya terbuat dari kayu yang memiliki\nkualitas tinggi.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Bangsal-Kencono-Daerah-Istimewa-Yogyakarta.jpg"
      },
      "senjata_khas": {
        "name": "Patrem",
        "description": "Patrem adalah salah satu senjata tradisional dari Provinsi Daerah Istimewa Yogyakarta. Patrem memiliki bentuk yang sama seperti Keris namun ukurannya lebih kecil. Dulu, senjata Patrem ini memiliki peran\nyang sangat besar dan digunakan oleh para pejuang wanita dengan menyelipkannya di pinggang. Senjata ini digunakan dalam perjuangan melawan kolonial Hindia Belanda. Di masa sekarang ini, sudah\njarang sekali orang yang masih memiliki senjata Patrem ini.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/patrem_yogya.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Kesatrian Ageng",
        "description": "Kesatrian Ageng adalah pakaian adat dari Provinsi Daerah Istimewa Yogyakarta. Kesatrian Ageng ini merupakan pakaian adat yang umumnya digunakan oleh laki-laki pejabat keraton yang sedang bertugas.\nPakaian Kesatrian Ageng dapat melambangkan keanggunan dan sifat berani dari seseorang. Pakaian ini terdiri atas jas laken, celana panjang, dan kain batik. Jas laken terbuat dari bahan beludru berwarna\nhitam yang dihiasi dengan motif keris dan batik pada bagian tengahnya serta motif keemasan pada bagian pinggirnya. Celana panjangnya juga memiliki warna hitam sama dengan jas laken. Lalu terdapat kain\nbatik yang dililitkan memutari pinggul dengan panjang di atas lutut. Terakhir, pakaian ini dilengkapi aksesoris dan hiasan kepala.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_yogya.jpg?raw=true"
      }
    },

    {
      "kode_provinsi": "prov-17",
      "nama_provinsi": "BALI",
      "kode_pulau": "3",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Coat_of_arms_of_Bali.svg/1200px-Coat_of_arms_of_Bali.svg.png",
      "tari_tradisional": {
        "name": "Tari Pendet",
        "description": "Tari Pendet adalah tarian Bali yang pada awalnya tari ini tercipta sebagai tari pemujaan. Karena perkembangan, tarian ini terjadi perubahan dalam gerakan dan dipentaskan sebagai Tarian\nUcapan Selamat Datang. Tari Pendet dapat ditarikan oleh laki-laki dan perempuan. Tari ini memiliki banyak jenis gerakan dan penari membawa mangkuk perak yang penuh bunga. Pada akhir\ntarian para penari menaburkan bunga ke arah penonton sebagai ucapan selamat datang.",
        "image": "https://indonesiakaya.com/wp-content/uploads/2020/10/tari_pendet_ie_1200.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Mejangeran",
        "description": "Mejangeran adalah salah satu lagu daerah yang berasal dari Bali. Lagu Mejarengan ini sangat terkenal terutama di Bali karena dipakai sebagai iringan musik untuk menari yaitu Tari Janger.\nPada lirik lagu ini menjelaskan seorang wanita yang sangat cantik dan menawan, memiliki kulit yang indah, sedang memetik bunga. Lirik lagu ini juga diartikan sebagai ajakan untuk menari\ndan untuk bersantai untuk melepas kejenuhan. Karena lagu ini adalah iringan untuk tari, lagu ini diartikan rasa kesedihan dan janggal dapat hilang dengan menari.",
        "image": "https://pix10.agoda.net/geo/city/17193/1_17193_02.jpg?s=1920x822",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Gapura",
        "description": "Rumah Gapura adalah rumah adat khas Bali. Rumah ini sebenarnya adalah sebuah bangunan yang dijadikan gerbang rumah-rumah tradisional Bali. Rumah Gapura ini berbentuk gapura atau\ndua buah candi yang terpisah dan menimbulkan bentuk yang simetri. Candi tersebut berfungsi untuk membatasi sisi kanan dan sisi kiri pintu masuk ke daerah pekarangan juga sebagai\nbangunan penyambut bagi yang datang ke puri.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Gapura-Candi-Bentar-Bali.jpg"
      },
      "senjata_khas": {
        "name": "Kandik Bali",
        "description": "Kandik Bali adalah salah satu senjata tradisional dari Provinsi Bali. Kandik dalam bahasa Bali memiliki arti Kapak. Dalam mitologi Bali, Kandik adalah simbol dari senjata para dewa. Ada\nmakna historis yang kuat yang menjadikan Kandik salah satu sejata khas Bali. Kandik digunakan laki-laki Bali untuk menebang dan membelah kayu. Kandik terbuat dari kapak besi atau\nperunggu dengan gagang yang juga terbuat dari besi. Kandik memiliki warna emas yang berkilau.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/kandik_balik.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Safari dan Kebaya",
        "description": "Safari dan Kebaya adalah pakaian adat dari Provinsi Bali. Safari adalah pakaian untuk pria Bali yang berbentuknya seperti kemeja, dengan kerah dan dan kancing. Baju safari memiliki dua\nkantong di bagian bawah kemeja. Ada juga saku di bagian dada sebelah kiri. Baju safari melambangkan kebersihan, sehingga baju ini memiliki warna putih yang dominan. Sedangkan Kebaya\nadalah pakaian untuk wanita Bali. Kebaya Bali disertai dengan selendang yang berfungsi sebagai sabuk. Selendang ini diikat dibagian perut. Kebaya Bali umumnya berwarna cerak dan\nbermotif sederhana. Kebaya ini selalu dipadukan dengan selendang yang diikat seperti sabuk. Dengan begitu, sisi anggun pada wanita yang mengenakannya lebih terpancar.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_bali.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-18",
      "nama_provinsi": "NUSA TENGGARA BARAT",
      "kode_pulau": "3",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Coat_of_arms_of_West_Nusa_Tenggara.svg/1200px-Coat_of_arms_of_West_Nusa_Tenggara.svg.png",
      "tari_tradisional": {
        "name": "Tari Gandrung Lombok",
        "description": "Tari Gandrung Lombok adalah tarian dari Lombok yang dilakukan secara berpasangan antara laki-laki dan perempuan. Tarian ini awalnya digunakan untuk menghibur para prajurit setelah\npulang dari medan perang. Tarian ini kemudian dikembangkan dan ditata ulang sebagai sebuah kesenian tari pertunjukan oleh para seniman di sana, dari segi gerak, busana, maupun jumlah\npenari. Dalam pertunjukannya, Tari Gandrung Lombok dibagi menjadi 3 babak.",
        "image": "https://pdbifiles.nos.jkt-1.neo.id/files/2015/09/09/oakirbin_gandrunglombok1.JPG",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Kadal Nongak",
        "description": "Kadal Nongak adalah salah satu lagu daerah yang berasal dari Nusa Tenggara Barat (NTB). Lagu Kadal Nongak ini sangat terkenal terutama di NTB karena memiliki kisah baik di baliknya.\nPada lirik lagu ini menjelaskan kadal bertahta pohon duri yang menghadap ke atas yang tidak mendengar ketika diberi nasihat. Lirik lagu ini menggambarkan seorang anak gadis yang berasal\ndari keluarga kerajaan yang tidak mendengar kata-kata kakaknya sehingga mendapat balasan atas kesalahan yang diperbuatnya sehingga ibunya mencoba menasehati dengan cara\nmenyairkannya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/ntb.png?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Dalam Loka",
        "description": "Rumah Dalam Loka adalah rumah adat khas Nusa Tenggara Barat atau NTB. Nama rumah ini terdiri atas dua kata yaitu Dalam dan Loka. Dalam artinya istana dan Loka artinya dunia.\nRumah ini digunakan sebagai pusat pemerintahan dan tempat tinggal raja-raja Sumbawa pada zaman dulu. Ukuran rumah ini cukup besar karena ditopang oleh 99 tiang yang menjadi lambang\nAsmaul Husna dalam Islam.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Adat-Dalam-Loka-Nusa-Tenggara-Barat.jpg"
      },
      "senjata_khas": {
        "name": "Tulup",
        "description": "Tulup adalah salah satu senjata tradisional dari Provinsi Nusa Tenggara Barat atau NTB. Tulup termasuk senjata yang umum digunakan untuk menyerang lawan dari jarak jauh. Selain itu,\nsenjata ini pula dapat digunakan untuk berburu. Nenek moyang dari Suku Sasak, NTB, menggunakan tulup sebagai alat untuk berburu hewan di hutan. Tulup menjadi senjata yang mudah dan\nmurah untuk dibuat dan ramah lingkungan karena terbuat dari tumbuhan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/tulup_ntb.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Pakaian Adat Suku Sasak",
        "description": "Pakaian Adat Suku Sasak adalah pakaian adat dari Provinsi Nusa Tenggara Barat atau NTB. Pakaian khas suku Sasak ini sering disebut dengan pakaian adat lambung dan pegon. Pakaian\nAdat Lambung adalah pakaian wanita yang terdiri atas atasan yaitu baju berwarna hitam dengan kerah menyerupai huruf V dan tanpa lengan. Untuk bawahannya menggunakan kain panjang\ndengan motif bordir kotak-kotak atau segitiga di bagian tepi. Kain bawahan dibalutkan ke pinggang dibantu dengan memakai sabuk atau disebut sabuk anteng yang berupa kain dan ujungnya\ndijuntaikan di pinggang kiri, tidak lupa memakai aksesoris sebagai pelengkap. Pakaian Adat Pegon adalah pakaian pria yang terdiri atas as hitam yang dilengkapi dengan bawahan berupa kain\npelung bermotif nangka yang disebut Cute. Terdapat aksesoris pelengkap berupa ikat kepala atau yang disebut dengan capuq. Selain itu, ada ikat pinggang atau leang yang dibuat dari kain\nsongket yang disulam benang emas. Tambahan aksesoris lainnya yaitu keris yang diselipkan di bagian samping atau belakang ikat pinggang.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_ntb.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-19",
      "nama_provinsi": "NUSA TENGGARA TIMUR",
      "kode_pulau": "3",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Coat_of_arms_of_East_Nusa_Tenggara.svg/180px-Coat_of_arms_of_East_Nusa_Tenggara.svg.png",
      "tari_tradisional": {
        "name": "Tari Ja'i",
        "description": "Tari Ja’i adalah tarian tradisional masyarakat Ngada di Flores, Nusa Tenggara Timur (NTT). Tarian ini merupakan tarian yang dilakukan oleh masyarakat di sana sebagai ungkapan rasa syukur\ndan kegembiraan. Selain itu, tari ini sering ditampilkan dalam berbagai acara seperti perayaan, upacara adat dan menyambut tamu kehormatan. Berbagai variasi dan perubahan sering\ndilakukan dalam pertunjukan tari ini namun tidak meninggalkan bentuk aslinya. Tari Ja’i memiliki nilai-nilai penting untuk kehidupan, baik dalam bersosial dan bermasyarakat.",
        "image": "http://2.bp.blogspot.com/-kUTHFSOkx1k/Vgk-kB6f2SI/AAAAAAAABtA/5i6MZJc9qsY/s1600/tari%2Bjai.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Gemu Fa Mi Re",
        "description": "Gemu Fa Mi Re adalah salah satu lagu daerah yang berasal dari Nusa Tenggara Timur (NTT). Lagu Gemu Fa Mi Re ini sangat terkenal terutama di NTT karena memiliki syair serta irama musik\nyang riang. Pada lirik lagu ini menjelaskan tentang kota Meumere adalah kota yang penuh dengan nyanyian. Gemu berarti memasukkan ke dalam mulut dan Fa Mi Re adalah notasi dalam\nsebuah lagu yang diartikan cara belajar notasi. Lagu ini diciptakan dengan irama yang menyenangkan dengan tujuan untuk bergembira, menari bersama-sama mengikuti irama lagu tersebut.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/ntt.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Musalaki",
        "description": "Rumah Musalaki adalah rumah adat khas Nusa Tenggara Timur atau NTT. Rumah ini digunakan sebagai tempat tinggal bagi kepala suku di sana. Suku yang memakai rumah ini umumnya\nadalah suku Ende Lio. Selain sebagai tempat tinggal, rumah ini juga digunakan sebagai untuk kegiatan musyawarah adat, tempat ritual upacara adat, dan lain sebagainya. Struktur rumah ini\nmenggunakan Struktur Wisu, Atap, Pondasi Kuwu Lewa, dan Maga.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Musalaki-Nusa-Tenggara-Timur.jpg"
      },
      "senjata_khas": {
        "name": "Klewang",
        "description": "Klewang adalah salah satu senjata tradisional dari Provinsi Nusa Tenggara Timur atau NTT. Klewang digunakan sebagai senjata untuk perang, untuk membela diri dari serangan musuh.\nKlewang menjadi senjata yang popouler di NTT karena digunakan untuk bertarung melawan musuh saat masa penjajahan. Senjata ini terbuat dari besi, kayu, dan bulu kuda. Senjatanya ini\nbiasanya disimpan di rumah-rumah adat seperti rumah kepala suku sebagai lambang persatuan marga atau kelompok.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/klewang_ntt.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Amarasi",
        "description": "Amarasi adalah pakaian adat dari Provinsi Nusa Tenggara Timur yang khas dari suku Atoni atau Atoin Meto atau Dawan. Pakaian untuk laki-laki adalah selimut tenun ikat dan baju dojo dan\ndilengkapi dengan beberapa perhiasan berupa kalung, ikat kepala berhias mutiara, gelang timor, dan muti salak. Pakaian untuk perempuan suku Atoni adalah sarung kain tenun, selendang,\ndan baju kebaya. Sebagai pelengkap, pakaian ini memiliki penggunaan perhiasan kalung muti salak, hiasan kepala mirip gelang, sisir emas, serta tusuk konde.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_ntt.jpg?raw=true"
      }
    },

    {
      "kode_provinsi": "prov-20",
      "nama_provinsi": "MALUKU",
      "kode_pulau": "4",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRjjgV4idoVYXMf8jv0J8jfFChwMB3B3w3-vDWsH35mCFfTFg0jJgdEOdFKXyWexYdRnxQ&usqp=CAU",
      "tari_tradisional": {
        "name": "Tari Poco-Poco",
        "description": "Tari Poco-Poco adalah tarian yang berasal dari Maluku. Awalnya, lagu tarian poco-poco hanya dikenal di lingkungan TNI dan Polri sebagai gerakan untuk senam pagi. Tari poco-poco lalu\nmulai disukai masyarakat pada saat stasiun televisi TVRI Jakarta mulai menyiarkan program dengan nama Dansa Yo Dansa. Lagu Poco-Poco diciptakan oleh Arie Sapulette. Gerakan pada\ntari ini seperti tentara yang sedang senam pagi, dasar gerakan poco-poco, yaitu dua kali gerak ke kanan, dua kali gerak ke kiri, mundur, dan memutar. Lama kelamaan, gerakan poco-poco\nterus berkembang dan bervariasi.",
        "image": "https://asset.kompas.com/crops/IWZ0sZntGhak_YGKvaVbmWGzl00=/0x19:972x667/750x500/data/photo/2018/08/06/2958981311.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Rasa Sayange",
        "description": "Rasa Sayange adalah salah satu lagu daerah yang berasal dari Maluku. Lagu Rasa Sayange ini sangat terkenal terutama di Maluku karena sering dinyanyikan oleh anak-anak dan memiliki rima\ndan suku kata yang sama seperti pantun dan memiliki pesan seperti pantun. Pada lirik lagu ini memiliki pantun seperti \"Mana kancil akan dikejar, kedalam pasar cobalah cari. Masih kecil rajin\nbelajar, sudah besar senanglah diri\". Lirik lagu ini menyatakan rasa peduli, kasih, dan sayang pada orang dan lingkungan sekitar serta sosial diantara masyarakat secara turun-temurun.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/maluku.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Baileo",
        "description": "Rumah Baileo adalah rumah adat khas Maluku. Rumah Baileo memiliki simbol tertentu yang melambangkan sebuah kemajemukan agama di daerah Maluku. Rumah ini berbentuk panggung\ndengan atap yang dibuat dari daun rumbai dan bambu yang ditata rapi. Ukuran rumah ini cukup besar karena rumah ini digunakan untuk musyawarah ataupun mengadakan acara. Rumah ini\nmemiliki ruangan khusus untuk penyimpanan benda pusaka suci.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Baileo-Maluku.jpg"
      },
      "senjata_khas": {
        "name": "Tombak Kalawai",
        "description": "Tombak Kalawai adalah salah satu senjata tradisional dari Provinsi Maluku. Sama seperti tombak lainnya, Tombak Kalawai memiliki tiga buah mata pisau namun ukurannya lebih panjang dari\ntombak biasa. Tombak Kalawai ini digunakan untuk berburu ikan dan hewan laut lainnya di sungai atau laut. Perburuan yang dilakukan adalah dengan menikam hewan laut tersebut. Pegangan\npada senjata ini terbuat dari bulu atau kayu dan ujungnya diberi besi tajam. Besi di ujung tersebut harus diasah sampai setajam mungkin sebelum senjata ini digunakan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/tombak_maluku.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Cele",
        "description": "Cele adalah pakaian adat dari Provinsi Maluku. Pakaian ini memiliki ciri khas yaitu motif garis-garis yang membentuk bentuk kotak-kotak kecil. Untuk perempuan, pakaian Cele dikenakan dengan\nkombinasi bagian lain seperti kain sarung yang warnanya tidak terlalu jauh beda ataupun dengan kebaya yang menjadi ciri khas pakaian wanita Indonesia. Serta dilengkapi oleh tusuk konde yang\nterbuat dari atau menyerupai emas dan perak disebut Haspel. Aksesoris ini juga dipadukan dengan Kak kuping sejumlah 4 buah dan berbentuk seperti kembang dan bunga Ron dilingkarkan pada\nkonde dan biasanya terbuat dari gabus. Selain itu ada kain Lenso yaitu kain saputangan yang diletakkan di pundak sebagai aksesoris pakaian. Untuk pria, pakaian Cele dibentuk menyerupai jas yang\ndipakai santai dengan kemeja sebagai dalamannya. Untuk celananya, kaum laki-laki memakai celana panjang formal biasa yang berwarna hitam atau senada dengan bajunya. Pakaian ini digunakan\nsaat upacara-upacara adat ataupun acara keluarga.",
        "image": "https://budayanesia.com/wp-content/uploads/2020/06/Baju-Cele-800x497.jpg"
      }
    },
    {
      "kode_provinsi": "prov-21",
      "nama_provinsi": "MALUKU UTARA",
      "kode_pulau": "4",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Coat_of_arms_of_North_Maluku.svg/1200px-Coat_of_arms_of_North_Maluku.svg.png",
      "tari_tradisional": {
        "name": "Tari Soya-Soya",
        "description": "Tari Soya-Soya adalah tarian yang berasal dari Maluku Utara. Tarian ini adalah Tarian ini diciptakan oleh seniman Kesultanan Ternate untuk mengabadikan peristiwa sejarah yang pernah terjadi\ndi masa lalu. Tarian ini mengandung makna ungkapan kebanggaan rakyat Ternate, karena keberhasilan para pejuang dalam mengusir penjajah dari tanah mereka di masa lalu. Soya-Soya\nsendiri berarti pantang menyerah atau penjemputan. Tari tradisional ini memiliki nilai kepahlawanan yang menjadi identitas penduduk Ternate yang pantang menyerah.",
        "image": "https://indonesiakaya.com/wp-content/uploads/2020/10/Gerakan_yang_paling_menonjol_dalam_tari_Soya-Soya_adalah_gerakan_kaki_yang_lincah_dan_enerjik_2.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Borero",
        "description": "Borero adalah salah satu lagu daerah yang berasal dari Maluku Utara. Lagu Borero ini sangat terkenal terutama di Maluku Utara karena memiliki nuansa dan lirik yang cukup membuat pendengar\nmerasa sedih. Lagu ini memberi pesan kepada orang-orang yang sedang jauh atau pergi merantau agar selalu mengingat pesan orangtua. Ketika sedang berdiam diri, dia teringat akan pesan-\npesan orangtuanya. Jauh dari rumah membuatnya sedih namun ia teringat akan pesan orangtua. Selain itu, lagu ini juga menjelaskan bahwa pesan yang diberikan oleh orangtua akan selalu\ndiingat sampai akhir hayatnya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/malut.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Sasadu",
        "description": "Rumah Sasadu adalah rumah adat khas Maluku Utara. Rumah Sasudu ini memiliki bentuk rumah panggung dengan jumlah pintu sebanayak enam. Dua pintu digunakan khusus untuk kaum\nlaki laki, dua pintu lainnya khusus untuk kaum perempuan, dan dua pintu sisanya digunakan untuk kedatangan para tamu. Karena banyaknya pintu, rumah ini berukuran cukup besar dan menjadi\nrumah dengan pintu terbanyak di Indonesia.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Rumah_adat_Sasadu_Desa_Gamtala.jpg"
      },
      "senjata_khas": {
        "name": "Parang Salawaku",
        "description": "Parang Salawaku adalah salah satu senjata tradisional dari Provinsi Maluku Utara. Parang Salawaku ini terdiri dari sepasang parang dan perisai, sesuai dengan dua kata pada namanya. Bagi\nmasyarakat setempat, sepasang parang dan perisai merupakan simbol dari kemerdakaan rakyat. Dalam filosofi masyarakat Maluku pula, senjata ini menyimbolkan anak laki-laki yang harus\nmelindungi keluarganya dalam kondisi apapun. Dulu, senjata ini digunakan untuk berperang dan untuk saat ini, Parang Salawaku digunakan sebagai properti tarian Cakalake.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/parang_malut.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Manteren Lamo",
        "description": "Manteren Lamo adalah pakaian adat dari Provinsi Maluku Utara. Pakaian ini terdiri atas celana panjang hitam dengan bis merah memanjang dari atas ke bawah, baju berbentuk jas tertutup dengan\nkancing besar terbuat dari perak berjumlah sembilan. Selain itu, leher jas, ujung tangan, dan saku jas yang terletak di bagian luar berwarna merah. Manteren Lamo sering dipadukan dengan celana\npanjang berwarna hitam polos hingga mata kaki sebagai bawahannya. Untuk aksesoris Manteren Lamo sering menggunakan penutup kepala. Manteren Lamo yang dikenakan pria terdiri atas jas\ntertutup dengan warna merah. Warna ini melambangkan kegagahan seorang pria.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_malut.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-22",
      "nama_provinsi": "PAPUA",
      "kode_pulau": "4",
      "image": "https://upload.wikimedia.org/wikipedia/commons/5/50/Coat_of_arms_of_Papua.png",
      "tari_tradisional": {
        "name": "Tari Sajojo",
        "description": "Tari Sajojo adalah tarian yang menggambarkan kebersamaan yang dirasakan setiap orang. Suasana keceriaan dan semangat kebersamaan ini bisa ditarikan oleh laki-laki maupun perempuan.\nTari Sajojo juga cara bagi masyarakat Papua untuk menyampaikan pesan selamat datang kepada para tamu kehormatan. Istilah Sajojo diambil dari lagu pengiringnya yang berjudul “Sajojo”.\nLagu tersebut menceritakan tentang seorang gadis yang diidolakan dan dicintai di kampungnya. Namun yang menjadi ciri khas dari tari ini adalah gerakannya yang bersemangat\nmenggambarkan kebahagiaan.",
        "image": "https://public.urbanasia.com/images/post/2019/uploads/d6f853ced3f74fcc9b7b1c8fd14797a1.PNG",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Apuse",
        "description": "Apuse adalah salah satu lagu daerah yang berasal dari Papua. Lagu Apuse ini sangat terkenal terutama di Papua karena sering digunakan sebagai lagu kesenian anak Sekolah Dasar. Pada lirik\nlagu ini menjelaskan tentang seorang anak atau cucu yang hendak pergi merantau ke negeri seberang, Teluk Doreri dan ia berpamitan kepada nenek atau kakeknya. Nenek atau kakeknya\nmemegang sapu tangan dan melambaikan tangan ketika melepas cucunya yang akan pergi. Teluk Doreri memiliki peran penting di tanah Papua dan saat ini menjadi pelabuhan baik untuk kapal\nDomestik Nasional, maupun antar pulau di Papua.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/papua.jpeg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Honai",
        "description": "Rumah Honai adalah adalah rumah adat khas Papua. Rumah ini disebut sebagai peninggalan nenek moyang yang sudah langka. Di masa sekarang ini, rumah Honai tidak lagi terawat. Rumah\nHonai tidak memiliki ukuran yang terlalu besar. Rumah ini memiliki bentuk yang unik karena dibuat dengan menggunakan daun rumai dan kayu. Walaupun begitu, rumah ini memiliki nilai\nestetikanya sendiri.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Honai-Papua.jpg"
      },
      "senjata_khas": {
        "name": "Panah",
        "description": "Panah adalah salah satu senjata tradisional dari Provinsi Papua. Panah ini memiliki busur, sama seperti alat panah pada umumnya. Busur yang dimiliki oleh senjata ini memiliki lima lubang panah.\nArtinya, dalam sekali melakukan panahan, dapat menggunakan lima panah sekaligus. Panah ini dulunya digunakan untuk berburu, berperang dengan suku lain, dan mempertahankan hidup dari\nserangan musuh. Busur pada senjata ini dibuat dari kayu yang lengkap dengan tali dari rotan, sedangkan anak panahnya dibuat dari kayu dengan bagian mata yang runcing.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/panahan_papua.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Koteka",
        "description": "Koteka akaian adat dari Provinsi Papua. Koteka adalah pakaian khusus yang dipakai untuk menutupi tubuh bagian bawah laki-laki di beberapa suku di Papua. Kata koteka berasal dari salah satu\nsuku di Paniai yang artinya pakaian. Ada dua ukuran koteka, yakni holim kecil (halus) dan holim pendek besar.  Jenis koteka kecil terdapat di daerah lembah Baliem, di Kecamatan Wamena Kota,\nKecamatan Asologaima dan Kecamatan Kurulu, ukuran bagian bawahnya sedang dan atasnya runcing. Koteka untuk laki-laki yang terbuat dari buah labu yang dikeringkan sedangkan Koteka untuk\nperempuan adalah wah (rok) rumbai yang terbuat dari serat kayu atau rumput. Agar Koteka tidak jatuh, maka harus diikat seputar pinggang dengan tali halus berwarna hitam.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_papua.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-23",
      "nama_provinsi": "PAPUA BARAT",
      "kode_pulau": "4",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Coat_of_arms_of_West_Papua.svg/1200px-Coat_of_arms_of_West_Papua.svg.png",
      "tari_tradisional": {
        "name": "Tari Yospan",
        "description": "Tari Yospan adalah tarian dari Papua Barat yang merupakan penggabungan dari dua jenis tari yaitu Yosim dan Pancar. Tari ini tarian pergaulan yang sering dibawakan laki-laki dan perempuan\nmuda sebagai bentuk persahabatan. Tari ini terdiri dari dua regu pemain yaitu regu musisi dan penari. Penari yospan lebih dari satu orang dengan gerakan dasar yang penuh semangat, dinamik,\ndan menarik. Selain itu, tari ini sudah sering ditampilkan pada saat acara-acara adat, kegiatan penyambutan, dan festival seni budaya.",
        "image": "https://www.mediapelangi.com/wp-content/uploads/2019/09/WhatsApp-Image-2019-09-01-at-21.14.36-1-1.jpeg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "E Mambo Simbo",
        "description": "E Mambo Simbo adalah salah satu lagu daerah yang berasal dari Papua Barat. Lagu E Mambo Simbo ini sangat terkenal terutama di Papua Barat karena memiliki nada dan irama yang\nmenggembirakan. Pada lirik lagu ini menjelaskan suka cita pertemuan seorang ayah dengan anaknya. Pada lirik lagu ini berkisah tentang seorang ayah yang kehilangan anaknya bernama\nMambo. Sang ayah keluar masuk kampung mencari sang anak hingga menemukannya di tengah hutan. Pertemuan ini kemudian dirayakan penuh suka cita dengan menari dan bernyanyi karena\nMambo telah kembali.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/papbar.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Mod Aki Aksa",
        "description": "Rumah Mod Aki Aksa adalah rumah adat khas Papua Barat. Rumah Mod Aki Aksa ini adalah tempat tinggal dari Suku Arfak, di daerah Manokwari. Rumah ini sangatlah unik karena memiliki\nseribu penyangga dan berbentuk panggung. Banyak orang menyebutnya dengan rumah kaki seribu. Rumah ini terbuat dari pohon-pohon dan memiliki desain untuk lingkungan Papua yang\nmemiliki dataran tinggi dan temperatur rendah.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/rumah_papbar.jpg?raw=true"
      },
      "senjata_khas": {
        "name": "Pisau Belati",
        "description": "Pisau Belati adalah salah satu senjata tradisional dari Provinsi Papua Barat. Pisau Belati yang dimiliki oleh Papua Barat berbeda dengan pisau belati kebanyakan karena terbuat dari tulang kaki\nburung Kasuari yang dibentuk runcing di ujungnya. Selain itu, pisau ini juga dilengkapi dengan hiasan dari bulu burung Kasuari. Pisau Belati digunakan oleh masyarakat Papua Barat untuk berburu,\nbertarung, dan mengambil hasil hutan. Sama seperti Provinsi Papua, mereka juga menggunakan senjata ini untuk bertahan hidup dan melindungi diri.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/pisau_papbar.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Ewer",
        "description": "Ewer pakaian adat dari Provinsi Papua Barat. Pakaian ini menggunakan bahan alam, yakni jerami sebagai bahan utama pembuatannya. Karena itu pakaian ini menjadi pakaian yang dibuat melalui\nproses yang ramah lingkungan. Pakaian untuk pria hanya dikenakan sebagai bawahan saja tanpa atasan. Bahan utama pembuatannya dari jerami yang telah dikeringkan, panjangnya bervariasi dan\ndikenakan di bagian pinggang. Pakaian untuk wanita terdiri atas bagian atasan dan bawahan. Untuk bawahannya juga terbuat dari jerami yang telah dikeringkan dan dikenakan di pinggang.\nSedangkan atasannya terbuat dari kain. Untuk aksesoris, pria dan wanita mengenakan sejenis penutup kepala dengan motif khas Papua Barat. Pakaian Ewer cukup sering digunakan oleh\nmasyarakat Papua Barat dalam upacara adat, upacara resmi atau lainnya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_papbar.jpg?raw=true"
      }
    },

    {
      "kode_provinsi": "prov-24",
      "nama_provinsi": "KALIMANTAN UTARA",
      "kode_pulau": "5",
      "image": "https://rekreartive.com/wp-content/uploads/2018/12/Logo-Kalimantan-Utara-Provinsi-Kalimantan-Utara.jpg",
      "tari_tradisional": {
        "name": "Tari Lalatip",
        "description": "Tari Lalatip atau biasa disebut Tari Magunatio adalah tarian tradisional yang berasal Suku Dayak Tahol Provinsi Kalimantan Utara. Lalatip memiliki arti menjepit. Tarian ini digunakan sebagai\nlatihan ketangkasan kaki dalam melompat dan menghindari rintangan karena adanya perang antar suku yang terjadi. Sehingga, keterampilam berperang wajib dimiliki oleh pemuda dan\npemudi Suku Dayak Tahol. Tari ini dibagi menjadi tiga kelompok pemain yaitu kelompok yang memainkan batang kayu, kelompok penari, dan kelompok pemain musik.",
        "image": "https://seringjalan.com/wp-content/uploads/2020/04/puncak-tari-lalatip-menari-ditutup-mata.jpeg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Bebilin",
        "description": "Bebilin adalah salah satu lagu daerah yang berasal dari Kalimantan Utara. Lagu Bebilin ini sangat terkenal terutama di Kalimantan Utara karena memiliki arti yang dalam untuk sesama\nmanusia. Lagu ini memberi pesan kepada manusia untuk menghindari perpecahan dan mengutamakan persatuan. Selain itu, kita sebagai manusia harus memiliki harga diri yang tinggi.\nWalaupun tidak memiliki harta, namun kita akan tetap dihormati. Selain itu, manusia juga harus memiliki cita-cita yang tinggi dan memiliki kemampuan dalam mengahadapi masalah agar\nmasalah dapat dengan mudah diselesaikan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/kalut.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Baloy",
        "description": "Rumah Baloy adalah rumah adat khas Kalimantan Utara. Rumah Baloy memiliki desain yang unik karena terinspirasi dari rumah tradisional suku Tidung. Rumah Baloy dianggap memiliki\narsitektur yang lebih bagus dan indah dibandingkan dengan rumah tradisional lain yang ada di Kalimantan. Warna yang digunakan pada rumah ini pun adalah warna yang indah.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Baloy-Kalimantan-Utara.jpg"
      },
      "senjata_khas": {
        "name": "Sipet",
        "description": "Sipet adalah salah satu senjata tradisional dari Provinsi Kalimantan Utara. Sipet ini senjata yang identik dengan budaya suku Dayak di Kalimantan Utara. Senjata ini adalah senjata yang dapat\ndipakai untuk melawan musuh ataupun menangkap mangsa saat berburu dari jarak yang jauh. Cara memakai senjata ini adalah siapkan sebuah anak panah yang terbuat dari bambu tipis yang\ndiraut tajam dan diberi racun, lalu masukkan ke dalam selongsong Sipet. Pada selongsong Sipet terdapat ujung pisau yang digunakan untuk menikam lawan dalam pertempuran jarak dekat.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/sipet_kalut.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Ta’a dan Sapei Sapaq",
        "description": "Ta’a dan Sapei Sapaq adalah pakaian adat dari Provinsi Kalimantan Utara. Ta’a merupakan pakaian adat untuk wanita yang terbuat dari beludru yang memiliki warna mencolok dan dengan aksesoris maupun\nhiasan manik-manik yang dijahit. Pada pakaian adat Ta’a terdapat tiga motif yang terdiri dari motif burung enggang, motif tumbuhan dan motif harimau serta hewan lainnya. Untuk pakaian motif\nburung enggang dan harimau ini biasanya dipergunakan untuk para bangsawan. Sementara untuk motif tumbuhan, biasanya digunakan oleh rakyat biasa. Sapei Sapaq merupakan pakaian adat untuk\npria. Untuk model dan motifnya, Sapei Sapaq mirip dengan Ta’a. Perbedaannya ada pada bagian bawah yaitu terdapat gulungan selendang. Namun, seiring berjalannya waktu, bawahan gulungan\nini diganti dengan menggunakan celena pendek hitam. Sapei Sapaq ini dilengkapi dengan kalung-kalung  yang terbuat dari tulang, taring hewan, serta biji-bijian dan juga terselip mandau pada bagian\npinggang.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_kalut.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-25",
      "nama_provinsi": "KALIMANTAN BARAT",
      "kode_pulau": "5",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Coat_of_arms_of_West_Kalimantan.svg/1200px-Coat_of_arms_of_West_Kalimantan.svg.png",
      "tari_tradisional": {
        "name": "Tari Ruai",
        "description": "Tari Ruai adalah tarian yang indah dan gemulai yang berasal dari Kalimantan Barat. Tari ini juga menggambarkan seekor burung yaitu Burung Ruai. Tari ini ditarikan oleh laki-laki maupun\nperempuan dengan mengenakan pakaian khas berwarna merah dan aksesoris sebagai pelengkap yang terbuat dari bulu ayam, ataupun juga dari bulu Buruang Ruai. Saat ini, tari ini\ndipentaskan untuk menyambut tamu. Dalam tari ini biasanya terdapat beras kuning yang digunakan untuk menyambut tamu dengan cara menyebarkannya.",
        "image": "https://madiuntoday.id/wp-content/uploads/2018/11/Tari-Ruai-Tarian-Suku-Dayak-yang-Indah-nan-Gemulai-wshendro-madiuntoday-4.jpeg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Cik Cik Periuk",
        "description": "Cik Cik Periuk adalah salah satu lagu daerah yang berasal dari Kalimantan Barat. Lagu Cik Cik Periuk ini sangat terkenal terutama di Kalimantan Barat karena lagu ini merupakan lagu daerah\nyang mewakili Kalimantan Barat. Pada lirik lagu ini menjelaskan cik-cik yaitu bunyi dari dalam periuk. Periuk adalah peralatan dapur yang terbuat dari logam atau tanah liat yang digunakan untuk\nmembuat nasi. Sebenarnya. lagu ini menggambaran kehidupan masa lampau masyarakat Sambas. Lagu ini menceritakan tentang kedatangan masyarakat luar ke Kalimantan Barat yang\ndianggap membawa budaya yang bertentangan dengan nilai-nilai setempat.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/kalbar.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Panjang",
        "description": "Rumah Panjang adalah rumah adat khas Kalimantan Barat. Sesuai dengan namanya, rumah adat ini memiliki ukuran yang panjang dan cukup besar karena memiliki bangunan di atas dan bawah.\nDesain rumah ini sangatlah bagus dan unik, seperti memiliki nuansa modern dan tradisional yang menyatu. Rumah ini memiliki bangunan yang bertema budaya Suku Dayak. Tema tersebut\nterlihat di sisi-sisi yang ada di rumah adat ini.",
        "image": "https://i1.wp.com/f1-styx.imgix.net/article/2021/04/27085637/rpj1-fasad-rumah-panjang-Kalimantan-Barat.jpg?fit=1000%2C667&ssl=1"
      },
      "senjata_khas": {
        "name": "Dohong",
        "description": "Dohong atau Duhung adalah salah satu senjata tradisional dari Provinsi Kalimantan Barat. Dohong termasuk ke dalam jenis pisau belati. Senjata ini dulunya menjadi salah satu senjata yang dimiliki\noleh para raja. Senjata ini digunakan untuk berperang dan berburu, bentuknya yang besar dan tajam menjadikan senjata ini sebagai alat untuk perlindungan diri. Untuk saat ini, Dohong digunakan\nsebagai alat untuk memotong tali pusar bayi, menyembelih hewan kurban, dan bercocok tanam. Dohong adalah senjata yang unik karena terbuat dari tanduk rusa. Namun karena bahan tersebut\nsudah langka, bahan dasar Dohong berganti menjadi kayu.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/dohong_kalbar.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "King Bibinge dan King Baba",
        "description": "King Bibinge dan King Baba adalah pakaian adat dari Provinsi Kalimantan Barat. King Bibinge adalah pakaian untuk wanita yang terbuat dari bahan yang menutupi hingga bagian dada dan pundak.\nKing Bibinge mengenakan hiasan manik-manik sebagai hiasan yang susunannya dibuat dengan rapi dan cantik. Selain itu, ada aksesoris ikat kepala dan perhiasan. Ikat kepala untuk perempuan\npembuatannya menggunakan bulu burung Enggang Gading. King Baba adalah pakaian untuk pria yang berbentuk seperti rompi dengan kain khas terbuat dari kulit kayu kapuo serta dihiasi manik-\nmanik berwarna jingga dan merah, bersama dengan ikat kepala yang terbuat dari bulu burung Enggang Gading. Juga, memakai senjata bernama mandau. King Baba dikenal juga sebagai baju\nperang suku Dayak. ",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_kalbar.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-26",
      "nama_provinsi": "KALIMANTAN TENGAH",
      "kode_pulau": "5",
      "image": "https://rekreartive.com/wp-content/uploads/2018/12/Logo-Kalteng-Provinsi-Kalimantan-Tengah-Original.jpg",
      "tari_tradisional": {
        "name": "Tari Giring-Giring",
        "description": "Tari Giring-Giring adalah tarian yang berasal dari suku Dayak Ma’anyan yang kemudian berkembang di Kalimantan Tengah, terutama di Kabupaten Barito. Nama Giring-Giring diambil dari\nnama tongkat yang dimainkan oleh para penarinya yaitu tongkat Giring-Giring. Dalam tari Giring Giring ada 2 jenis tongkat yaitu tongkat panjang dan tongkat pendek. Tongkat panjang\ndipegang di tangan kiri yang digunakan untuk menghentakkan ke lantai. Sedangkan tongkat pendek dipegang di tangan kanan dan dimainkan dengan cara diayunkan. Tari ini mengekspresikan\nkegembiraan dan rasa senang yang dirasakan oleh masyarakat.",
        "image": "https://allaboutborneo.files.wordpress.com/2014/05/giring.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Manasai",
        "description": "Manasai adalah salah satu lagu daerah yang berasal dari Kalimantan Tengah. Lagu Manasai ini sangat terkenal terutama di Kalimantan Tengah karena dipakai sebagai iringan musik untuk\nmenari yaitu Tari Manasai. Pada lirik lagu ini menjelaskan pukulan gendang diiringi kangkanung sambil bergerak ke kanan dan kiri, maju dan mundur. Kemudian, memakai kain dan selendang\nyang diikat di pinggang mengelilingi sangkai lunuk, yaitu semacam \"tugu\" terbuat dari ikatan ranting pohon beringin. Lagu yang berirama kegembiraan ini mengajak masyarakat untuk menari\nTari Manasai.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/kalteng.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Betang",
        "description": "Rumah Betang adalah rumah adat khas Kalimantan Tengah. Rumah adat ini menjadi tempat yang dihuni oleh masyarakat suku Dayak. Rumah Betang ini berukuran sangat besar karena dapat\nditinggali oleh 100 sampai 150 jiwa. Rumah ini disebut pula rumah suku karena sekian jiwa tinggal bersama pemimpinnya. Untuk bangunan, Rumah Betang memiliki syarat yaitu ulu harus searah\ndengan matahari terbit, sedangkan hilirnya mengarah ke matahari terbenam. Hal itu merupakan simbol kerja keras dalam mempertahankan hidup.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Betang-Kalimantan-Tengah.jpg"
      },
      "senjata_khas": {
        "name": "Lonjo",
        "description": "Lonjo adalah salah satu senjata tradisional dari Provinsi Kalimantan Tengah. Lonjo adalah sejenis tombak dengan mata yang runcing dan dapat digunakan dalam jarak dekat. Lonjo adalah senjata\nyang digunakan untuk berburu hewan di hutan karena dapat melumpuhkan hewan dalam jarak dekat. Bagian ujung runcing pada Lonjo biasanya diberikan racun agar hewan-hewan buruan dapat\nlumpuh dalam sekali tembak. Selain itu, Lonjo juga dipakai untuk berperang di zaman dulu. Lonjo menjadi salah satu senajata yang sering dijadikan souvernir untuk wisatawan yang berkunjung ke\nKalimantan Barat.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/lonjo_kalteng.png?raw=true"
      },
      "pakaian_adat": {
        "name": "Upak Nyamu",
        "description": "Upak Nyamu adalah pakaian adat dari Provinsi Kalimantan Tengah. Pakaian ini terbuat dari kulit kayu nyamu yang dipipihkan sehingga bisa digunakan sebagai bahan pembuat pakaian dan ewah\n(cawat). Baju yang terbuat dari kulit nyamu ini kadang dibentuk seperti rompi, kadang juga dibentuk seperti baju tanpa lengan. Pakaian Upak Nyamu juga tergolong langka. Untuk menghindari\nkepunahan, harus ada upaya khusus untuk membuat pakaian adat tersebut tetap lestari dan dikenal oleh banyak orang.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_kalteng.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-27",
      "nama_provinsi": "KALIMANTAN SELATAN",
      "kode_pulau": "5",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Coat_of_arms_of_South_Kalimantan.svg/1200px-Coat_of_arms_of_South_Kalimantan.svg.png",
      "tari_tradisional": {
        "name": "Tari Baksa Kembang",
        "description": "Tari Baksa Kembang adalah tari klasik dari Keraton Banjar dari Kalimantan Selatan. Tarian ini dulunya dijadikan sebagai kegiatan penyambutan tamu yang dilakukan oleh putri-putri keraton\nBanjar. Saat ini, tarian Baksa Kembang ditampilkan dalam kegiatan uparara pernikahan. Nilai dari tarian ini adalah menghormati dan menghargai tamu merupakan kegiatan yang mulia. Hal ini\nmerupakan budaya bangsa yang harus kita junjung tinggi. Tari ini menceritakan tentang putri remaja yang cantik jelita sedang bermain-main riang gembira di taman bunga. Tarian ini dilakukan\noleh wanita berjumlah ganjil, baik tunggal maupun jamak asal berjumlah ganjil.",
        "image": "https://www.gandespamantes.org/wp-content/uploads/2020/01/Baksa-Kembang-Tarian-Klasik-Dari-Kerajaan-Banjar.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Ampar Ampar Pisang",
        "description": "Ampar Ampar Pisang adalah salah satu lagu daerah yang berasal dari Kalimantan Selatan. Lagu ini sangat terkenal terutama di Kalimantan Selatan karena sering dinyanyikan oleh anak-anak\ndan menjadi lagu permainan anak-anak. Lagu ini memilik beberapa makna, yang pertama adalah menjelaskan tentang pembuatan makanan yang terbuat dari pisang yang harus dijemur di\npanasnya sinar matahari. Proses akan menjadi selesai ketika pisang sudah mengeluarkan aroma manis yang khas. Selain itu, lagu ini juga mengajarkan anak-anak untuk memiliki sifat yang\nsabar, sama halnya seperti menunggu proses pembuatan pisang rimpi yang cukup sulit dan banyak proses. Sabar adalah salah satu hal yang membuat hidup menjadi lebih baik.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/kalsel.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Baanjung",
        "description": "Rumah Baanjung adalah rumah adat khas Kalimantan Selatan, rumah khas Suku Banjar. Rumah ini sangat populer sehingga disebut sebagai ikon dari Rumah Banjar. Rumah ini dibuat dengan\ngaya panggung yang memiliki anjung pada kanan dan kiri bangunan. Atap rumah ini berbentuk sindang langit tanpa plafon. Jumlah anak tangga di rumah ini adalah ganjil. Kemudian, terdapat\nlapangan yang mengelilingi Kandang Rasi Berukir.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/0/09/Rumah_Bubungan_Tinggi_Anjungan_Kalsel_TMII_Jakarta.JPG"
      },
      "senjata_khas": {
        "name": "Parang Nabur",
        "description": "Parang Nabur adalah salah satu senjata tradisional dari Provinsi Kalimantan Selatan. Parang Nabur termasuk senjata yang mirip dengan golok dan pedang. Senjata ini memiliki bentuk yang\ndipengaruhi oleh ciri khas pisau Eropa dan berpadu dengan agama Islam. Dulu, senjata ini digunakan sebagai pertahanan diri. Untuk saat ini, Parang Nabur digunakan sebagai alat rumah tangga,\nalat pertanian, alat untuk berburu, dan masih banyak lagi. Parang Nabur terbuat dari kayu pilihan dan panjangnya adalah 75 cm.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/parang_kalsel.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Bagajah Gamuling Baular Lulut",
        "description": "Bagajah Gamuling Baular Lulut adalah pakaian adat dari Provinsi Kalimantan Selatan. Pakaian ini dipengaruhi oleh budaya Hindu pada jaman dahulu dan menjadi pakaian ciri khas dari Kalimantan\nSelatan. Bagajah Gamuling Baular Lulut juga merupakan salah satu pakaian pengantin yang kaya akan rentengan bunga melati dan mawar. Pakaian untuk wanita berbentuk kain yang membalut tubuh\nhingga menutupi dada seperti gaun dan menggunakan kemban. Lalu ditambahkan aksesoris berupa selendang, ikat pinggang, konde yang berhiaskan mahkota dan bagian bawah menggunakan kain\npanjang yang bermotif halilipan sebagai rok. Pakaian untuk pria berbentuk kain sasirangan yang dililitkan menjadi bawahan. Atasan yang digunakan tidak memiliki kerah dan bawahannya \nmenggunakan celana panjang. Lalu ditambahkan aksesoris seperti kalung samban, ikat pinggang, kain yang bermotif kelabang dan penutup kepalanya yaitu mahkota yang melingkar berbentuk ular lidi.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_kalsel.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-28",
      "nama_provinsi": "KALIMANTAN TIMUR",
      "kode_pulau": "5",
      "image": "https://rekreartive.com/wp-content/uploads/2018/12/Logo-Kaltim-Provinsi-Kalimantan-Timur-Original.jpg",
      "tari_tradisional": {
        "name": "Tari Enggang",
        "description": "Tari Enggang adalah tarian yang berasal dari suku Dayak Kenyah yang dibawakan untuk memuliakan nenek moyang. Enggang sendiri berarti Burung Enggang, masyarakat suku Dayak\nKenyah sangat memuliakan burung ini. Makna lain dari tari ini adalah dulu masyarakat suku Dayak Kenyah sering berpindah tempat tinggal (nomaden) sama seperti Burung Enggang.\nMasyarakat berpindah secara berkelompok untuk menghindari peperangan. Waktu itu, masih banyak terjadi perang antarsuku. Tari ini dibawakan oleh perempuan muda dan memiliki tiga\ngerakan dasar.",
        "image": "https://www.goodnewsfromindonesia.id/uploads/post/large-m-tari-burung-enggang-1-56398acb548d5e4422aee5948eb857a3.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Buah Bolok",
        "description": "Buah Bolok adalah salah satu lagu daerah yang berasal dari Kalimantan Timur. Lagu Buah Bolok ini sangat terkenal terutama di Kalimantan Timur karena buah bolok adalah buah yang khas di\nKalimantan Timur khususnya Kutai. Pada lirik lagu ini menjelaskan bahwa buah bolok adalah buah yang disukai kancil, kijang, dan rusa. Namun liriknya juga menjelaskan tentang Kalimantan\nTimur itu sendiri untuk melestarikan rumah-rumah adat dan hal-hal lainnya. Secara umum, lagu ini bertujuan mengajak dan mengenalkan kepada para wisatawan dan pendatang untuk datang\ndan mengetahui tentang kebudayaan Kalimantan Timur.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/kaltim.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Lamin",
        "description": "Rumah Lamin adalah rumah adat khas Kalimantan Timur. Rumah ini dianggap sebagai identitas dari masyarakat suku Dayak yang tinggal di Kalimantan Timur. Rumah Lamin dapat menampung\nsekitar 12 sampai 30 keluarga atau bisa dibilang 100 jiwa karena ukurannya yang besar. Rumah ini memiliki banyak ukiran dan gambar yang masing-masing memiliki makna bagi masyarakat suku\nDayak di Kalimantan. Ukiran dan gambar tersebut dipercaya untuk menjaga keluarga mereka dari bahaya.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Lamin-Kalimantan-Timur.jpg"
      },
      "senjata_khas": {
        "name": "Mandau",
        "description": "Mandau adalah salah satu senjata tradisional dari Provinsi Kalimantan Timur. Mandau sebenarnya adalah senjata yang dimiliki oleh semua provinsi di Kalimantan, namun berbeda bentuk dan nama.\nMandau yang dimiliki oleh Kalimantan Timur dulunya digunakan oleh kalangan raja dan kepala suku. Senjata berbentuk pedang ini memiliki dua jenis yaitu Mandau biasa dan Mandau Tampilan.\nMandau Tampilan adalah senjata perang dan digunakan untuk upacara adat sedangkan Mandau biasa digunakan untuk sehari-sehari. Senjata ini memiliki hiasan burung Enggang, burung\nkhas Kalimantan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/mandau_kaltim.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Kustin",
        "description": "Kustin adalah pakaian adat dari Provinsi Kalimantan Timur. Pakaian ini terbuat dari bahan beludru berwarna hitam yang menjadikan tampilannya terlihat mewah. Dulu, pakaian ini merupakan baju yang\ndipakai oleh kalangan menengah ke atas sebagai busana pernikahan. Kustin perempuan memiliki pasmen di bagian leher, lengan, dan bagian dada. Di bagian depan dihiasi dengan Tapeh Berumbai,\nyaitu kain panjang yang dihiasi dengan rumbai dari benang emas. Dilengkapi dengan perhiasan berbentuk lambang wapen dan kain sarung yang dibentuk seperti rok. Hiasan kepala menggunakan\nkembang goyang yang terbuat dari logam sepuhan emas. Kustin aki-laki memiliki pasmen di bagian leher, ujung lengan, dan dada. Atasan ini dipadukan dengan celana panjang hitam dengan bagian\nluar celana dililitkan dodot rambut, yaitu kain panjang yang ujungnya diberi hiasan rumbai warna keemasan. Bagian kepala laki-laki mengenakan Setorong dengan ciri khas bulu yang menjadi hiasan\ndi bagian atas topi. Bagian atas dihiasi dengan pasmen warna emas dan hiasan berbentuk wapen di bagian depan. Wapen yang dikenakan berdasarakan gelar yang dimiliki pemakainya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_kaltim.jpg?raw=true"
      }
    },

    {
      "kode_provinsi": "prov-29",
      "nama_provinsi": "GORONTALO",
      "kode_pulau": "6",
      "image": "https://upload.wikimedia.org/wikipedia/commons/3/35/Lambang_propinsi_gorontalo.jpg",
      "tari_tradisional": {
        "name": "Tari Saronde",
        "description": "Tari Saronde adalah tari yang berasal dari Gorontalo. Tarian ini merupakan sebuah tarian yang diambil dari tradisi pada saat malam pertunangan serta rangkaian upacara perkawinan adat\nmasyarakat Gorontalo. Umumnya tarian ini dilakukan oleh para penari perempuan dan penari laki-laki. Dulu, Saronde difungsikan sebagai sarana dalam Molihe Huali, yaitu tradisi yang\ndilakukan calon mempelai pria untuk mengintip atau menengok calon mempelai perempuan. Untuk saat ini, Tari Saronde menjadi rangkaian adat pernikahan suku Gorontalo karena merupakan\nbagian dari adat dan tradisi yang tidak bisa ditinggalkan.",
        "image": "https://4.bp.blogspot.com/-_Q-yvuOcBa8/Wl2nL2b9OsI/AAAAAAAAAO4/PrfgXZLULsIWXIU7l4Gk0DY0bPQ496huACLcBGAs/s1600/Budayanusantara.web.id.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Binte Biluhuta",
        "description": "Binte Biluhuta adalah salah satu lagu daerah yang berasal dari Gorontalo. Lagu ini sangat terkenal terutama di Gorontalo karena dalam lagu ini menjelaskan mengenai makanan khas dari\ndaerah Gorontalo. Dalam Bahasa Indonesia, Binte yang artinya jagung dan masyarakat Gorontalo sering menyebutnya Milu. Sedangkan Biluhuta artinya disiram jadi kalau diartikan namanya\nmenjadi jagung yang disiram. Binte Biluhuta adalah nama makanan berupa sup yang terdiri dari jagung, ikan atau udang, yang dimasak dan menjadi makanan lezat. Makanan Binte Biluhuta ini\nmemiliki banyak manfaat karena memiliki jagung sebagai bahan dasar makanan. Maka dari itu, pencipta lagu ini merasa terinspirasi dan menulis lagu tentang makanan lezat ini.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/gorontalo.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Dolohupa",
        "description": "Rumah Dolohupa adalah rumah adat khas Gorontalo. Rumah ini terlihat seperti rumah gaya modern dan klasik. Rumah ini berbentuk panggung dengan dua tangga di sisi kanan dan kiri pada\nbagian depan. Rumah ini memiliki atap yang sangat estetik dan elegan, menjadikannya sebagai ciri khas. Rumah Dolohupa ini terbuat dari kayu yang memiliki kualitas tinggi, kuat, dan\ntahan lama.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Dulohupa-Gorontalo.jpg"
      },
      "senjata_khas": {
        "name": "Wamilo",
        "description": "Wamilo adalah salah satu senjata tradisional dari Provinsi Gorontalo. Wamilo termasuk ke dalam jenis pedang. Wamilo adalah senjata yang digunakan oleh Masyarakat Gorontalo untuk kegiatan\npertanian, perkebunan, dan menyembelih hewan ternak. Selain itu, senjata ini dulu digunakan untuk perlindungan diri bagi para lelaki ketika sedang bekerja di hutan. Wamilo memiliki bentuk\nyang sekilas mirip golok namun pedang ini berbeda dengan pedang lain karena ujung matanya berbentuk pipih namun sangat tajam.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/wamilo_gorontalo.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Biliu dan Makuta",
        "description": "Biliu dan Makuta adalah pakaian adat dari Provinsi Gorontalo. Pakaian ini biasanya mudah dijumpai pada saat upacara-upacara adat pernikahan atau pada kegiatan tertentu seperti Festival Saronde. Pakaian\nBiliu adalah pakaian wanita yang memiliki banyak aksesoris hiasan pernak-pernik. Keistimewaan baju tersebut menampakkan perempuan gorontalo bagai seorang ratu pada sebuah kerajaan. \nPakaian Makuta adalah pakaian pria yang memiliki 3 aksesoris Pada umumnya setiap warna juga sering kali digunakan pada upacara adat pernikahan Gorontalo. Ketujuh warna tersebut di antaranya\nmerah, hijau, kuning, ungu, cokelat, hitam serta warna putih. Pada setiap warna memiliki makna dan filosofi yang terkandung di dalamnya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_gorontalo.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-30",
      "nama_provinsi": "SULAWESI UTARA",
      "kode_pulau": "6",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Coat_of_arms_of_North_Sulawesi.svg/1200px-Coat_of_arms_of_North_Sulawesi.svg.png",
      "tari_tradisional": {
        "name": "Tari Maengket",
        "description": "Tari Maengket adalah tarian dari masyarakat Minahasa di Sulawesi Utara yang ditujukan sebagai ungkapan rasa syukur sehabis panen padi. Tari ini dipentaskan kelompok berpasangan\nyang umumnya dibawakan oleh 12 pasang penari laki-laki dan perempuan. Mereka menari sambil menyanyi dipimpin oleh kapel, yang diperankan oleh seorang wanita. Istilah Maengket\nberasal dari kata “engket” yang berarti bergerak bersama, juga bisa diartikan mengangkat tumit naik-turun sesuai lagu. Saat ini, tari ini juga dipentaskan untuk berbagai kegiatan, sebagai\npendidikan, sosial, atau hanya sekedar hiburan.",
        "image": "https://goodminds.id/handsome/wp-content/uploads/2021/02/Tari-Maengket.jpeg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Sipatokaan",
        "description": "Sipatokaan adalah salah satu lagu daerah yang berasal dari Sulawesi Utara. Lagu Sipatokaan ini sangat terkenal terutama di Sulawesi Utara karena memiliki makna atau cerita bagi provinsi itu\nsendiri. Pada lirik lagu ini menjelaskan seorang anak yang hendak pergi merantau dan ibunya berpesan \"Jika kau pergi ke tanah yang jauh, maka pergilah dengan hati-hati, Sayang\". Secara\numum, lagu ini menggambarkan rasa kekhawatiran dan rasa sayang seorang ibu kepada anaknya yang pergi merantau dan beliau mengingatkan anaknya untuk selalu berhati-hati karena\nbanyak hal bisa terjadi kepada sang anak.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/sulut.jpeg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Walewangko",
        "description": "Rumah Walewangko atau Rumah Pewaris adalah rumah adat khas Sulawesi Utara. Rumah ini adalah rumah yang dihuni oleh masyarakat dari Suku Minahasa. Rumah ini berbentuk panggung\ndengan dua tangga pada bagian depan rumah. Rumah ini memiliki atap yang berbentuk limas yang memiliku ukiran unik di bagian depannya. Rumah Walewangko ini terbuat dari kayu yang juga\nmemiliki kualitas bagus dan tahan lama.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Pewaris-Sulawesi-Utara.jpg"
      },
      "senjata_khas": {
        "name": "Pedang Bara Sangihe",
        "description": "Pedang Bara Sangihe adalah salah satu senjata tradisional dari Provinsi Sulawesi Utara. Pedang ini berasal dari suku Sangihe, suku yang ada di Sulawesi Utara. Pedang ini adalah senjata yang\ndigunakan oleh salah satu pahlawan Sulawesi Utara yang bernama Hengkeng U Nang. Ia rajin mengasah keahliannya bergulat dan juga ketangkasannya dalam bermain Pedang Bara. Ia juga\nmenggunakan pedang ini untuk melawan musuh-musuhnya. Pedang bara Sangihe menjadi salah satu senjata tradisional kebanggaan masyarakat Sulawesi Utara.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/pedang_sulut.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Laku Tepu",
        "description": "Laku Tepu adalah pakaian adat dari Provinsi Sulawesi Utara yang berasal dari Suku Sangihe Talaud yang sering digunakan pada saat upacara Tulude. Pakaian adat ini terbuat dari serat kofo atau\nserat tanaman pisang yang dikenal kuat dan mudah dipintal untuk menjadi bentuk pakaian. Serat tersebut kemudian di tenun dan dipintal untuk menjadi selembar pakaian yang dikenal dengan nama\nLaku Tepu. Biasanya pakaian adat ini berwarna cerah mencolok seperti merah, hijau, atau kuning. Laku Tepu sendiri adalah jenis pakaian yang memiliki lengan panjang, dengan untaiannya menjulur\nhingga ke tumit. Pakaian ini memiliki kategorinya yaitu pakaian untuk pemerintahan berwarna biru, merah, dan kuning, pakaian adat untuk ritual berwana merah atau ungu yang dilengkapi dengan\nselendang, dan pakaian untuk pernikahan menggunakan aksesoris sunting topo-topo yang berupa penutup kepala.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_sulut.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-31",
      "nama_provinsi": "SULAWESI BARAT",
      "kode_pulau": "6",
      "image": "https://berita.sulbarprov.go.id/images/Radio/logo-besar.png",
      "tari_tradisional": {
        "name": "Tari Potangnga",
        "description": "Tari Potangnga adalah tarian yang berasal dari Sulawesi Barat. Potangnga adalah sebutan bagi para nelayan pencari telur ikan terbang, atau biasa disebut ikan tiung-tiung. Para nelayan di\nsana tidak hanya berburu ikan terbang, tapi juga mengolah telur ikan terbang, khususnya di pesisir pantai desa. Mencari ikan terbang dan mengolah telurnya sudah menjadi rutinitas para\nnelayan di mandar sejak dahulu kala. Sebelum para nelayan berangkat, terdapat prosesi pemberkatan atas keselamatan dan melimpahnya telur ikan. Hal ini tidak terlepas dari kegiatan adat\ntradisi setempat.",
        "image": "http://paradetarinusantara.com/wp-content/uploads/2019/08/Parade-Tari-Nusantara-2019-Sulawesi-barat-004.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Tenggang Tenggang Lopi",
        "description": "Tenggang Tenggang Lopi adalah salah satu lagu daerah yang berasal dari Sulawesi Barat. Lagu ini sangat terkenal terutama di Sulawesi Barat karena memiliki arti mengenai ciri khas atau adat\nyang dilakukan oleh masyarakat Mandar, di Sulawesi Barat. Kata Tenggang artinya adalah berlayar dan kata Lopi artinya adalah perahu. Masyarakat Mandar memiliki adat atau kebiasaan yaitu\nberlayar menggunakan perahu. Berlayar menggunakan perahu ini menjadi tradisi turun temurun yang dilakukan oleh Masyarakat Mandar. Lagu ini juga digunakan agar masyarakat Mandar ingat\nakan kampung halamannya serta adat di dalamnya ketika mendengar lagu ini.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/sulbar.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Boyang",
        "description": "Rumah Boyang adalah rumah adat khas Sulawesi Barat. Rumah ini disebut juga sebagai Rumah Mandar karena penghuni asli rumah ini berasal dari suku Mandar, suku etnis asli Sulawesi\nBarat. Rumah ini digunakan sebagai tempat tinggal suku Mandar. Rumah ini memiliki anak tangga dengan jumlah ganjil di bagian depan dan belakang. Dinding rumah ini terbuat dari papan\ndengan hiasan ukiran dan motif khas dari suku Mandar. Atap Rumah Boyang berbentuk prima yang terbuat dari daun rumbia.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Boyang-Sulawesi-Barat.jpg"
      },
      "senjata_khas": {
        "name": "Badik",
        "description": "Badik adalah salah satu senjata tradisional dari Provinsi Sulawesi Barat. Badik ini adalah senjata yang digunakan untuk membela diri, mempertahankan harga diri keluarga, melindungi diri dari\nserangan musuh ataupun untuk berburu. Senjata ini diyakini juga senjata ini dapat memberikan kedamaian, kemakmuran dan kesejahteraan namun dipercaya juga dapat memberikan pengaruh\nnegatif bagi pemiliknya. Di Sulawesi Barat, badik dibagi menjadi tiga jenis yaitu Badik Bugis Luwu, Badik Kawali Lamalomo Sugi, dan Badik Makassar.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/badik_sulbar.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Lipa Saqbe Mandar",
        "description": "Lipa Saqbe Mandar adalah pakaian adat dari Provinsi Sulawesi Barat. Lipa Saqbe Mandar memiliki ciri khas khusus yaitu dari segi corak (sure' ataupun bunga). Cara pembuatannya yang membuatnya terkenal\nke daerah sekitarnya (bugis dan makassar). Saat ini terdapat 2 jenis Lipa Saqbe bila dilihat dari motifnya yaitu Sure dan Bunga. Perbedaannya Sure' yaitu Lipa Saqbe yang merupakan motif asli dari\nsarung sutra mandar, ciri-cirinya tidak memiliki hiasan atau bunga yang mencolok. Sedangkan Bunga yaitu Lipa Saqbe yang memiliki motif dan hiasan berupa bunga ataupun lainnya, yang merupakan\nturunan dari Sure agar Lipa Saqbe tampak lebih cantik.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_sulbar.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-32",
      "nama_provinsi": "SULAWESI TENGAH",
      "kode_pulau": "6",
      "image": "https://1.bp.blogspot.com/-Mb3OPbim3Gw/VrYYo_59GjI/AAAAAAAAVFw/oh24hNmZ1NU/s1600/LOGO%2BSULAWESI%2BTENGAH.png",
      "tari_tradisional": {
        "name": "Tari Mokambu",
        "description": "Tari Mokambu adalah tarian yang berasal dari kota Palu yang dilakukan pada saat penjemputan tamu atau menyambut tamu. Tari ini memiliki tujuan yang sama dengan Tari Motaro. Tari ini\numumnya dibawakan oleh perempuan. Pakaian yang digunakan dalam tari ini dinamakan baju Pokko, dilengkapi dengan selendang di bagian kepala dan sarung Donggala di bagian\nbawahnya. Pada akhir gerakan tari ini, penari melakukan gerakan menyiram beras kuning. Saat ini, tari ini juga dipentaskan untuk kegiatan seni dan budaya.",
        "image": "https://fs.genpi.co/uploads/news/watermark/2019/04/19/8ce76a091cb1ae0cf83773c27034dc18.jpeg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Palu Ngataku",
        "description": "Palu Ngataku adalah salah satu lagu daerah yang berasal dari Sulawesi Tengah. Lagu Palu Ngataku ini sangat terkenal terutama di Sulawesi Tengah karena memiliki cerita mengenai provinsi ini\nkhususnya kota Palu. Pada lirik lagu ini menjelaskan kota Palu adalah tempat tinggal ia dan keluarganya yang sejak dulu sudah terkenal namanya dan banyak penghasilannya. Secara umum,\nlagu ini menggambarkan tentang kerinduan mendalam seseorang yang sedang merantau di negeri orang terhadap kampung halamannya di kota Palu. Ia merindukan keindahan Palu, tempat\ntinggal ia dan keluarganya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/sulteng.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Tambi",
        "description": "Rumah Tambi adalah rumah adat khas Sulawesi Tengah. Rumah ini khusus dihuni oleh masyarakat suku Lore dan suku Kali. Rumah ini digunakan sebagai tempat tinggal untuk kepala adat.\nJika biasanya rumah adat memiliki anak tangga ganjil, Rumah Tambi memiliki anak tangga dalam jumlah genap. Rumah ini berbentuk panggung dengan atap yang bisa digunakan sebagai\ndinding. Rumah ini memiliki pondasi yaitu batu alam dengan tangga dari bambu dan daun rumba.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Tambi-Sulawesi-Tengah.jpg"
      },
      "senjata_khas": {
        "name": "Pasatimpo",
        "description": "Pasatimpo adalah salah satu senjata tradisional dari Provinsi Sulawesi Tengah. Pasatimpo merupakan senjata yang mirip keris, bahkan disebut sebagai keris dari Sulawesi Tengah. Pada jaman\ndulu, Pasatimpo digunakan pada acara ritual kesembuhan dan dapat mengusir aura jahat. Selain itu, Pasatimpo juga digunakan untuk melindungi diri, memotong hewan dan mencari kayu bakar.\nUntuk saat ini, senjata ini digunakan sebagai pelengkap pakaian adat saat menampilkan tari kepahlawanan.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/pasatimpo_sulbar.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Nggembe",
        "description": "Nggembe adalah pakaian adat dari Provinsi Sulawesi Tengah. Nggembe adalah pakaian khusus wanita yang warnanya terdiri atas warna merah atau warna kuning dan dikombinasikan dengan corak\nberwarna hitam atau berwarna coklat. Pakaian ini berupa baju terusan yang longgar dan lengannya pendek dengan hiasan berupa manik-manik. Pakaian Nggembe ini berbentuk segi empat dan berbentu\nbulat di kerah baju dengan bawahan yaitu Buya Sabe Kumbaja, rok panjang dan mekar. Bawahan ini terbuat dari sarung yang ditenun dan berasal dari Donggala. Sarung tenun ini diikatkan pada\npinggang wanita dengan sisa ikatan tersebut dibiarkan terjuntai sebagai hiasan. Aksesoris yang ada pada pakaian wanita ini adalah berupa anting panjang yang disebut dali taroe, gelang yang disebut\nponto date, gemo atau kalung berunyai, dan ikat pinggang yang terbuat dari emas yang disebut pende.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_sulteng.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-33",
      "nama_provinsi": "SULAWESI TENGGARA",
      "kode_pulau": "6",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Coat_of_arms_of_Southeast_Sulawesi.svg/1200px-Coat_of_arms_of_Southeast_Sulawesi.svg.png",
      "tari_tradisional": {
        "name": "Tari Lariangi",
        "description": "Tari Lariangi adalah tarian yang berasal dari Sulawesi Tenggara. Lariangi terdiri dari dua suku kata, yaitu lari dan angi. Lari berarti menghias atau mengukir, sedangkan angi berarti orang-orang\nyang berhias. Kata Lari diwujudkan dengan aksesoris dan pakaian yang dipakai oleh para penari. Masing-masing perwujudan lari memiliki simbol-simbol. Contohnya, untuk pada bagian kepala\ndisebut panto dan pintoru melambangkan derajat bangsawan. Selain menari, mereka melantunkan syair-syair. Isinya mengisahkan kapal-kapal yang masuk ke wilayah Sulawesi Tenggara.\nTari Lariangi ditetapkan menjadi Warisan Budaya Nasional UNESCO pada 2013.",
        "image": "https://seringjalan.com/wp-content/uploads/2020/04/sejarah-tari-Lariangi.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Tanah Wolio",
        "description": "Tanah Wolio adalah salah satu lagu daerah yang berasal dari Sulawesi Tenggara. Lagu ini sangat terkenal terutama di Sulawesi Tenggara karena lagu ini menceritakan tentang daerah\nSulawesi Tenggara itu sendiri. Judul lagu ini diambil dari nama sebuah kecamatan di kota Bau Bau, yaitu Wolio. Maka dari itu, lagu ini menceritakan tentang kecamatan Walio. Wolio merupakan\nsalah satu daerah dengan yang dikenal dengan kekayaan serta keindahan alamnya seperti hasil tambang dan hasil laut. Selain itu, lagu ini menggambarkan harapan akan kesejahteraan dan\nmasa depan yang cerah melalui potensi-potensi yang dimiliki oleh daerah Wolio.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/sultengga.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Malige",
        "description": "Rumah Malige adalah rumah adat khas Sulawesi Tenggara. Rumah ini merupakan rumah khas dari suku Buton, suku yang ada di sana. Kata Malige berasal dari kata Mahligai yang artinya\nistana. Rumah ini digunakan sebagai tempat tinggal sultan (raja), dengan keluarganya. Rumah ini berbentuk panggung dan memiliki empat lantai. Lantai dua ukurannya lebih kecil dari lantai\nsatu, lantai tiga ukurannya lebih kecil dari lantai dua, namun lantai empat lebih luas dari lantai tiga. Rumah Malige terbuat dari kayu jati dan wola dengan semua pasaknya terbuat dari kayu\ntanpa menggunakan paku.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Buton-Malige-Sulawesi-Tenggara.jpg"
      },
      "senjata_khas": {
        "name": "Keris Arung Palakka",
        "description": "Keris Arung Palakka atau keris La Makkawa adalah salah satu senjata tradisional dari Provinsi Sulawesi Tenggara. Keris ini adalah senjata yang merupakan pusaka kerajaan. Senjata ini dimiliki\noleh Arung Palakka yang merupakan seorang Sultan Kerajaan Bone. Arung Palakka sangatlah dihormati rakyat Bone karena kesaktian dan kepedualiannya terhadap rakyat. Ia menggunakan Keris\nLa Makkawa dalam setiap peperangan membela Bone di sepanjang hidupnya. Keris La Makkawa dapat membunuh musuh hanya dengan sekali goresan. Sehingga keris Arung Palakka menjadi\nsenjata turun-temurun bagi Raja Kesultanan Buton.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/keris_sultengga.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Kinawo",
        "description": "Kinawo adalah pakaian adat dari Provinsi Sulawesi Tenggara. Pakaian ini adalah hasil karya dari suku Tolaki. Kinawo berarti kulit kayu. Jadi, baju adat Kinawo adalah pakaian adat suku Tolaki, Sulawesi\nTenggara, yang terbuat dari kulit kayu. Baju adat Kinawo terbuat dari kulit kayu Usongi, Otipulu, Dalisi, dan Wehuka. Kulit kayu ini direbus dengan abu dapur, direndam dan dipukul-pukul hingga lembut\nhingga diperoleh seratnya.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20baju/pakaian_sultengga.jpg?raw=true"
      }
    },
    {
      "kode_provinsi": "prov-34",
      "nama_provinsi": "SULAWESI SELATAN",
      "kode_pulau": "6",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Coat_of_arms_of_South_Sulawesi.svg/1200px-Coat_of_arms_of_South_Sulawesi.svg.png",
      "tari_tradisional": {
        "name": "Tari Kipas Pakarena",
        "description": "Tari Kipas Pakarena adalah tarian yang dipentaskan oleh perempuan maupun laki-laki yang rangkaian gerakannya mencerminkan karakter halus dan lembut wanita Sulawesi Selatan dan\nkaum lelakinya yang keras dan tegas. Gerakan itu terwakili oleh hentakan musik yang mengiringi tarian ini. Tari ini memiliki ciri utama yaitu kipas dan selendang, gerakan tangan lambat,\nlangkah tenang, dan musik yang bergemuruh. Tari ini memiliki sejarah yang dikaitkan dengan penghuni khayangan dan penghuni bumi.",
        "image": "https://akumaubelajar.com/wp-content/uploads/2020/02/tari-kipas-dan-propertinya.jpg",
        "video": "r6hQomWsHAE"
      },
      "lagu_daerah": {
        "name": "Pakarena",
        "description": "Pakarena adalah salah satu lagu daerah yang berasal dari Sulawesi Selatan. Lagu Pakarena ini sangat terkenal terutama di Sulawesi Selatan karena dipakai sebagai lagu kesenian untuk\nanak-anak. Pada lirik lagu ini menjelaskan orang Makassar memiliki adat yang khas sejak dulu, pakarena yang anggun dalam setiap penampilan. Setiap ada pesta atau acara, akan lebih indah\ndan bagus jika ada Pakarena. Secara umum, lagu ini menggambarkan tentang keindahan acara yang diiringi dengan musik khas Makassar. Penampilan yang anggun serta dilakukan bersama\nyang damai di dalam acara tersebut.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20lagu/sulsel.jpg?raw=true",
        "video": "rKhWGy3spRE"
      },
      "rumah_adat": {
        "name": "Rumah Tongkonan",
        "description": "Rumah Tongkonan adalah rumah adat khas Sulawesi Selatan. Rumah ini merupakan rumah adat orang Toraja. Rumah ini digunakan sebagai tempat tinggal, kekuasaan adat, dan tempat\nperkembangan kehidupan sosial budaya orang Toraja. Rumah Tongkonan memiliki sarat dengan ukiran melambangkan status sosial pemilik rumah tersebut menempati lapisan atas. Rumah ini\nterbuat dari kayu dan dibentuk seperti rumah panggung dengan tujuan agar tidak diganggu binatang buas, ditambah dengan atap seperti perahu.",
        "image": "https://blogunik.com/wp-content/uploads/2019/10/Rumah-Adat-Indonesia-Rumah-Tongkonan-Sulawesi-Selatan.jpg"
      },
      "senjata_khas": {
        "name": "Alamang",
        "description": "Alamang adalah salah satu senjata tradisional dari Provinsi Sulawesi Selatan. Dalam istilah Bugis dan Makassar, Alamang lebih dikenal dengan nama Sudang, sedangkan dalam Bahasa Toraja lebih\ndikenal dengan istilah Labbo. Alamang menjadi senjata turun temurun kerajaan Bone dan hanya dipakai oleh seorang raja. Bagi masyarakat Sulawesi Selatan, Alamang juga memiliki filosofi\ntersendiri yang harus dihormati, sebagai simbol kemakmuran, kedaulatan, dan kewibawaan kerajaan. Untuk saat ini, senjata Alamang dibuat lagi dan menjadi hasil dari warisan leluhur.",
        "image": "https://github.com/grassdiamond/daftar_gambar/blob/main/foto%20senjata/alamang_sulsel.jpg?raw=true"
      },
      "pakaian_adat": {
        "name": "Bodo",
        "description": "Bodo  adalah pakaian adat dari Provinsi Sulawesi Selatan. Pakaian ini terbuat dari kain tenun yang sudah dikenal sejak abad ke 9 oleh masyarakat suku Bugis. Bentuk pakaian ini cukup sederhana yaitu\nberbentuk segi empat yang lengannya pendek di atas siku. Dulu, pakaian Bodo hanya digunakan pada acara penting saja seperti upacara pernikahan. Namun kini juga digunakan sebagai busana untuk\ntari tradisional baik untuk perlombaan maupun penyambutan tamu. Pakaian ini berasal dari tenunan kapas yang dipilin dan disatukan dengan benang. Hasil tenunan kain muslin ini terdapat rongga-rongga\nkecil sehingga transparan tidak serapat dan setebal kain lainnya. Kain ini sangat cocok digunakan untuk daerah tropis. Pakaian Bodo ini melambangkan sebuah kecantikan dan keanggunan seorang\nperempuan. Perpaduan baju Bodo dan sarung membuat setiap wanita Bugis memiliki aura keanggunan yang tinggi.",
        "image": "https://asset.kompas.com/crops/AmD6p3IH3KuRvG__AMz6x612HxE=/51x58:537x382/750x500/data/photo/2021/02/24/60364762c1b65.jpg"
      }
    }



  ]
}